[{"title":"=[NHÓM 01]=","tags":["nhom01","giới","thiệu","bản","dịch"],"category":"","content":"NHÓM 01: VỀ ZICTIONARY & BẢN DỊCH\n\nZictionary là một bộ từ điển về game xếp gạch cực kì hữu ích. Ở đây, bạn có thể tìm hiểu hầu hết mọi thứ liên quan đến trò chơi này.\n\nĐể nhảy nhanh tới mục lục, hãy gõ \"mucluc\" trên thanh tìm kiếm.\n\nĐây là bản Việt hóa của Squishy từ bản dịch tiếng Anh của User670 và C₂₉H₂₅N₃O₅.\nĐược chuẩn hóa lại nhờ sự giúp đỡ của cộng đồng Tetris Việt Nam.\nBản dịch có thể có sai sót so với Zictionary tiếng Trung (bản gốc).\n\nBạn muốn đóng góp vào bản dịch? Bạn có thể vào trang dự án Techmino trên GitHub để làm nhé.","link":"https://github.com/26F-Studio/Techmino/blob/main/parts/language/dict_vi.lua","id":"7926bd35ccd93b6debe05dec9893e4b23ad6639c"},{"title":"Mục lục","tags":["nhom01","index","mucluc"],"category":"help","content":"01. Về Zictionary & Bản dịch game & Mục lục ← bạn đang xem mục này\n02. Dự án Techmino: Trang web chính thức, Dự án trên GitHub, Discord\n03. Ủng hộ cho tác giả của Techmino\n04. Mẹo và lời khuyên:\n        - Lời khuyên dành cho những người mới tập chơi\n        - Đề xuất luyện tập, Học làm T-spin, Điều chỉnh DAS\n        - Bố cục phím, Khả năng xử lý gạch, Các nút xoay\n\n05. Các yếu tố cần thiết của các game xếp gạch hiện đại:\n        - Next, Hold, In-place Hold, Swap, Topping out, Vùng đệm, Vùng biến mất\n        05A. Gạch: Hình dạng, màu, hướng và tên của gạch\n        05B. Hệ thống xoay gạch: ARS, ASC, ASC+, BRS, BiRS, C2RS, C2sym, NRS, SRS, SRS+, TRS, XRS\n        05C. Hệ thống điều khiển: IRS, IHS, IMS\n        05D. Cách kiểu xáo gạch: Túi 7 gạch, His, EZ-Start, Reverb, C2\n            (và hiện tượng Drought của một vài kiểu xáo)\n\n        05E. Thông số\n            05E1. Thông số của game:\n                - Tốc độ rơi, 20G\n                - ARE, Line ARE, Death ARE\n                - Lockdown Delay, Spawn & Clear delay\n            05E2. Thông số điều khiển:\n                DAS & ARR, DAS cut, Auto-lock cut, IRS cut, SDF\n        05F. Điều khiển\n            05F1. Tốc độ: LPM, PPS, BPM, KPM, KPP\n            05F2. Kỹ thuật: Hypertapping, Rolling, Finesse\n            05F3. Độ trễ đầu vào\n        05G. Khả năng tấn công\n            - APM, SPM, DPM, RPM, ADPM, APL\n            - Tấn công & Phòng thủ\n            - Combo, Spike, Debt, Passthrough, Timing\n\n        05H. Hành động bất cẩn (Mis-): Misdrop, Mishold\n        05I. Spin: (Mini) / (All-) / (T-) / (O-) spin; Fin, Neo, Iso; Freestyle\n        05J: Kỹ thuật xóa hàng:\n            - Single, Double, Triple (Xóa 1/2/3 hàng); Techrash; Tetris\n            - TSS, TSD, TST, MTSS, MTSD\n            - Perfect Clear, Half Perfect Clear\n        05K. Các thuật ngữ khác: sub, 'Doing Research', Bone block\n\n06. Các game xếp gạch\n        (Danh sách rất dài, gõ trên thanh tìm kiếm \"nhom06\" để xem danh sách đầy đủ)\n\n07. Một vài cơ chế và chế độ của một số game:\n            - Tàng hình một phần, tàng hình hoàn toàn\n            - Chế độ MPH, Secert Grade, Deepdrop\n08. Bot: Cold Clear, ZZZbot\n\n09. Wiki; các trang web bày setup & cung cấp câu đố, chia sẻ setup\n        09A. Wiki: Chinese Tetris Wiki, Wiki Hard Drop, tetris.wiki, Tetris Wiki Fandom\n        09B. Bày setup: Four.lol, Tetris Hall, Tetris Template Collections, tetristemplate.info, 4-Wide Trainer\n        09C. Chia sẻ câu đố: TTT, TTPC, NAZO, TPO\n        09D. Chia sẻ setup: Fumen, Fumen bản Điện thoại\n10. Cộng đồng: Tetris Online Servers, Tetris Việt Nam\n\n11. Xếp lên và đào xuống\n        11A. Stacking (Xếp lên):\n            - Side / Center / Partial well\n            - Side / Center 1 / 2 / 3 / 4-wide\n            - Residual\n            - 6-3 Stacking\n        11B. Digging (Đào xuống)\n\n12. Setup (Opener, Mid-game setup, Donation, Pattern)\n        12A. Opener: DT Cannon, DTPC, BT Cannon, BTPC, TKI 3 Perfect Clear, QT Cannon, Mini-Triple, Trinity, Wolfmoon Cannon, Sewer, TKI, God Spin, Albatross, Pelican, Perrfect Clear Opener, Grace System, DPC, Gamushiro Stacking\n        12B. Mid-game: C-spin, STSD, Fractal, LST stacking, Imperial Cross, King Crimson, PC liên tiếp (1+2+3)\n        12C. Donation: Hamburger, STMB Cave, Kaidan, Shachiku Train, Cut Copy\n\n13. Cách tính lượng sát thơng gây ra: Tetris Online / Notris Foes, Techmino\n\n14. Console và chuyện quản lý dữ liệu game\n        - Console, đặt lại thiết lập, tình trạng mở khóa, bố cục phím\n        - Xóa toàn bộ thành tích, kỷ lục, bản phát lại, bộ nhớ đệm\n15. Các thuật ngữ không liên quan gì tới Tetris (tiếng Anh): SFX, BGM, TAS, AFK","link":"","id":"153c1e55f589e02b7932a72d1e4683df3ebd292d"},{"title":"=[NHÓM 02]=","tags":["nhom02"],"category":"","content":"NHÓM 02: DỰ ÁN TECHMINO","link":"","id":"b1179b38381460a357e2aecf7bfc415a46c562b2"},{"title":"Website chính thức","tags":["nhom02","websites;","trang","chủ"],"category":"org","content":"Trang web chính thức của Techmino!\\nBạn có thể lấy bản mới nhất của Techmino cũng như tạo tài khoản, thay avatar ngay tại đó\\nNhấn vào nút hình địa cầu ở bên phải để mở website trên trình duyệt của bạn.","link":"http://studio26f.org","id":"1886285b352c8f95146cc7d1cc39c16745b501d9"},{"title":"Dự án trên GitHub","tags":["nhom02;","mã","nguồn","mở;","github;","repository;","kho","lưu","trữ"],"category":"org","content":"Repository chính thức của Techmino trên GitHub. Chúng tôi sẽ rất cảm kích nếu bạn tặng cho chúng tôi một ngôi sao!","link":"https://github.com/26F-Studio/Techmino","id":"cbfde028a744aca323d1a6f5a1d22e0d03784594"},{"title":"Discord","tags":["nhom02","máy","chủ","server"],"category":"org","content":"Discord của Techmino chính là nơi mà bạn có thể cập nhật mọi thông tin về Techmino, hoặc đơn giản là đến trò chuyện với tất cả mọi người.\n\nNhấn nút hình địa cầu để tham gia cùng chúng tôi!","link":"https://discord.gg/f9pUvkh","id":"44eba79ca0eb70be8f3025972c324915a79262d1"},{"title":"=[NHÓM 03]=","tags":["nhom03"],"category":"","content":"NHÓM 03: ỦNG HỘ CHO TÁC GIẢ CỦA TECHMINO","link":"","id":"f9120fe0156e312d5b04a822d5f8a4b8a6645dfe"},{"title":"=[NHÓM 03]=","tags":["nhom03"],"category":"","content":"Nội dung của nhóm này đã bị ẩn đi do yêu cầu của nền tảng. Nhưng bạn vẫn có thể hỏi về nội dung này trong server Discord của chúng tôi.","link":"","id":"f94fd4c6e7abbaa7fd5d0a669df73142ac1eea12"},{"title":"Ủng hộ 1","tags":["nhom03;","wechat","alipay"],"category":"org","content":"Để ủng hộ cho Techmino thông qua WeChat Pay hoặc Alipay, gõ \\\"support\\\" ở trong console và quét mã QR.","link":"","id":"40366f34c726520e2baf5cd93b151d6bb43932a5"},{"title":"*ĐÃ ẨN*","tags":[],"category":"org","content":"","link":"","id":"dd4b934536db95436f5d707915f0aa768497fe4e"},{"title":"Ủng hộ 2","tags":["nhom03;","afdian","aidadian"],"category":"org","content":"Để ủng hộ cho Techmino qua Aifadian, nhấn vào nút hình địa cầu để mở trang ủng hộ này. Lưu ý là Aifadian sẽ tính thêm 6% phí giao dịch.","link":"https://afdian.net/@MrZ_26","id":"d6498d56c4dbfe91395fd37dd72cc9697120cb3a"},{"title":"*ĐÃ ẨN*","tags":[],"category":"org","content":"","link":"","id":"dd4b934536db95436f5d707915f0aa768497fe4e"},{"title":"Ủng hộ 3","tags":["nhom03;","patreon"],"category":"org","content":"Để ủng hộ cho Techmino qua Patreon, hãy nhấn vào nút hình địa cầu để mở trang ủng hộ này. Lưu ý là Patreon có thể tính phí dịch vụ cho bạn đối với các giao dịch trên một số tiền nhất định.","link":"https://www.patreon.com/techmino","id":"da131c1f4ff290137f50655625b909522d6e2e40"},{"title":"*ĐÃ ẨN*","tags":[],"category":"org","content":"","link":"","id":"dd4b934536db95436f5d707915f0aa768497fe4e"},{"title":"=[NHÓM 04]=","tags":["nhom04"],"category":"","content":"NHÓM 04: MẸO & LỜI KHUYÊN","link":"","id":"a67510a23a19222238355f523f5655e9e97196f4"},{"title":"Mới tập chơi?","tags":["guides","newbie","noob","readme","recommendations","suggestions","helps"],"category":"help","content":"Chúng tôi có vài lời khuyên dành cho những người mới chơi xếp gạch:\n    Hai thứ cơ bản:\n        1. Chọn những game xếp gạch chuyên nghiệp có cơ chế điều khiển tốt. Techmino, TETR.IO, Jstris và Tetris Online là một số lựa chọn khá tốt đấy. Đừng chơi những game có đánh giá không tốt bởi vì đa số chúng không đi sát với Guideline, hoặc là có cơ chế điều khiển tệ hại; gây ảnh hưởng xấu trong quá trình luyện tập.\n        2. Dành thời gian để học các kỹ năng cơ bản đã. Cố gắng dành nhiều thời gian hơn cho các kỹ năng như đọc hàng NEXT hoặc có thể xóa Tetris một cách ổn định. Làm chủ các phần cơ bản trước khi nghĩ tới những kỹ năng nâng cao hơn như T-spin.\n    Ba kỹ năng cần có:\n        1. Nhớ các vị trí xuất hiện của gạch.\n        2. Nhớ các chuỗi thao tác để di chuyển gạch đến vị trí mong muốn.\n        3. Suy nghĩ trước về vị trí đặt viên gạch sắp tới.\n\nBạn có thể nhấn nút Mở link để mở bài \"Suggestion for new players to Tetris Online\", viết bởi Tatianyi - một người chơi xếp gạch ở Trung Quốc (dịch sang tiếng Anh bởi User670).","link":"https://github.com/user670/temp/blob/master/tips_to_those_new_to_top.md","id":"b7742ebf044060cf4022bdc27cd05eae335f4eb3"},{"title":"Đề xuất luyện tập","tags":["nhom04","readme","noob","new","guides","recommendations","suggestions","helps;","đề","xuất","luyện","tập;","người","mới","chơi;","hướng","dẫn;","lời","khuyên;","gợi","ý"],"category":"help","content":"Lời khuyên khi tập chơi:\nSau đây là vài lời khuyên của chúng tôi để cải thiện kỹ năng chơi của bạn. Bạn cũng đừng ngại nghỉ ngơi và dành nhiều thời gian hơn để chơi những chế độ bạn thích nếu bạn cảm thấy mệt mỏi. Chúc bạn thành công!\n\nNhững lời khuyên này đã được sắp xếp thành nhóm với độ khó tăng dần. Tuy vậy, chúng tôi khuyên bạn hãy làm cả 3 cùng lúc thay vì từng cái một (A → B → C)\n\nA. Stacking (Xếp gạch)\n        A1. Suy nghĩ kỹ trước khi đặt gạch. Chưa vừa ý? Suy nghĩ thêm lần nữa.\n        A2. Xếp gạch càng phẳng càng tốt để bạn có thể ra quyết định đặt gạch dễ dàng hơn.\n        A3. Lên kế hoạch trước cách xếp, hãy tận dụng tối đa NEXT và HOLD để giữ được thế đẹp.\n\nB. Efficiency & Speed (Hiệu quả & Tốc độ)\n        B1. Đừng dựa vào bóng gạch quá nhiều! Nên tập trung vào việc suy nghĩ vị trí tốt nhất cho gạch đó.\n        B2. Nên sử dụng 2 (hoặc 3, tùy game) phím xoay thay vì nhấn 1 phím xoay liên tục trong thời gian dài.\n        B3. Đừng lo lắng về tốc độ khi bạn mới tập chơi Finesse. Bạn có thể bắt đầu học bằng cách chơi chậm, rồi từ từ bạn có thể tập chơi nhanh hơn khi đã quen tay - việc này không khó đâu!\n\nC. Practice (Luyện tập):\n    Cố gắng hoàn thành các chế độ sau\n        C1. \"40 hàng\".\n        C2. \"40 hàng\" mà không dùng HOLD.\n        C3. \"40 hàng\" mà chỉ được làm Techrash.\n        C4. \"40 hàng\" mà chỉ được làm Techrash và không được dùng HOLD.\n\nMẹo: Bạn có thể điều chỉnh độ khó nhóm C tùy vào khả năng của bạn.\n\nSau khi xong nhóm C, hãy luyện tập tiếp nhóm A, đây là kỹ năng RẤT quan trọng trong bất kỳ game xếp gạch nào. Sau khi làm chủ được kỹ năng đọc NEXT thì bạn dễ dàng thành thạo các thứ khác.","link":"","id":"1504750dbb0e6d16e1ae6afd24c8bea17f0aac05"},{"title":"Học làm T-spin","tags":["nhom04","tspin;","học;","hướng","dẫn;","mẹo;","lời","khuyên;","đề","xuất"],"category":"help","content":"T-spin là một kỹ năng khá khó, không tài nào thành thạo nổi nếu chỉ có nhìn vào địa hình nơi làm T-spin. Bạn cần phải có kỹ năng đọc NEXT và lên kế hoạch tốt để có thể làm T-spin\n\nLời khuyên của chúng tôi, bạn nên bắt đầu học làm T-spin khi bạn có thể:\n    - Xoá 40 hàng trong vòng 60 giây (tùy vào khả năng cá nhân con số này sẽ khác)\n    - Xóa 40 hàng chỉ dùng Tetris\n    - Xóa 40 hàng chỉ dùng Tetris + không HOLD mà không bị mất tốc độ quá nhiều\n\nNhững chế độ này sẽ giúp bạn củng cố kỹ năng đọc NEXT và lên kế hoạch.","link":"","id":"5e6f167a1c05c7e380f1d79c0213316986a72e7d"},{"title":"Điều chỉnh DAS","tags":["nhom04","das","tuning"],"category":"help","content":"Với những người chơi đã có kinh nghiệm mà muốn chơi nhanh hơn, khuyên dùng DAS 4-6f (67-100 ms) và ARR 0f (các viên gạch sẽ ngay lập tức dính vào tường khi DAS kết thúc).\\n\\nNếu bạn thấy khó điều khiển, hãy thử tăng DAS lên 1-2f, nhưng giữ ARR bé hơn 2f (33 ms).\\n\\nTóm lại, DAS nên để thấp nhất có thể nhưng vẫn phải đảm bảo được game có thể phân biệt được bạn đang nhấn hay giữ phím trong khi ARR để ở mức thấp nhất có thể.","link":"","id":"1d313f9b7b750999ce724488d61eac2967fd5551"},{"title":"Bố cục phím","tags":["nhom04","feel"],"category":"help","content":"Dưới đây là vài lời khuyên hữu ích khi bạn đang chỉnh sửa bố cục phím\n\n1. Một ngón tay chỉ nên thực hiện một chức năng duy nhất. Ví dụ như: một ngón cho sang trái, một ngón cho sang phải, một ngón cho rơi mạnh, …; và gán một ngón tay cho cả phím xoay trái và xoay phải (vì không ai xoay cả hai phía cùng một lúc cả)\n\n2. Trừ khi bạn tự tin với ngón út của mình, thì không nên để ngón tay này làm bất kì việc nào hết! (Vì chúng rất kém linh hoạt). Lời khuyên: nên xài ngón trỏ và ngón giữa vì hai ngón này là nhanh nhẹn nhất, nhưng bạn cũng có thể thoải mái tìm hiểu xem các ngón tay của mình nhanh chậm thế nào, mạnh yếu ra sao.\n\n3. Không nhất thiết phải sao chép bố cục phím của người khác, vì không ai giống ai. Bố cục phím thường không ảnh huởng quá nhiều đến kỹ năng của bạn nếu bạn đã tuân theo quy tắc 1 và 2.","link":"","id":"485e0b794b2fb31f381aed4ad96f46f44df1b5bd"},{"title":"Khả năng xử lý gạch","tags":["nhom04","feel","handling"],"category":"help","content":"Những yếu tố sau có thể ảnh hưởng tới việc xử lý gạch của bạn:\n\n1. Độ trễ đầu vào, có thể là do cấu hình, thông số hoặc tình trạng của thiết bị. Khởi động lại trò chơi; bảo dưỡng, sửa chữa thiết bị của bạn hoặc đổi sang thiết bị mới có thể khắc phục vấn đề này.\n2. Độ ổn định của game, phụ thuộc vào cách thiết kế và cách lập trình của game. Có thể cải thiện tình trạng này bằng cách tắt hiệu ứng hình ảnh hoặc để chất lượng đồ họa ở mức thấp.\n3. Thiết kế có chủ đích trong game.\n4. Thông số điều khiển gạch chưa hợp lí (ví dụ: DAS, ARR, SDARR,…). Thay đổi các cài đặt này có thể giúp bạn.\n5. Tư thế chơi không hợp lý. Hãy thử tìm tư thế chơi thoải mái nhất có thể.\n6. Thao tác không quen sau khi đổi bố cục phím hoặc thiết bị. Tập làm quen với chúng hoặc thay đổi cài đặt phím.\n7. Mỏi cơ, chuột rút,… làm cho việc phản ứng và phối hợp tay khó khăn hơn. Hãy nghỉ ngơi và trở lại sau một vài ngày.","link":"","id":"2b7e8773e5693b33e04c4b38d8901c0e47bf7c4a"},{"title":"Các nút xoay","tags":["nhom04","doublerotation","phím","xoay"],"category":"help","content":"Dùng cả nút xoay trái và phải sẽ giảm số lần nhấn nút, vì xoay một hướng ba lần thì cũng tương tự xoay một lần hướng ngược lại.\\nĐây cũng là một thứ cần phải lưu ý nếu bạn muốn thành thạo Finesse.\\n\\nNếu bạn dùng thêm nút xoay 180°, bạn có thể xoay tới bất kì hướng nào chỉ với 1 lần nhấn phím (nếu không xét spin).\\n\\nTuy nhiên, chúng tôi không khuyến khích dùng 180° vì không phải game nào cũng hỗ trợ xoay 180°, và sự khác biệt về tốc độ giữa việc dùng hai nút và ba nút là không quá đáng kể.\\nBạn có thể bỏ qua kỹ thuật này trừ khi bạn muốn chơi nhanh hơn chớp.","link":"","id":"ed4c4d951cf06b326be9b00c9a3c6afe33064674"},{"title":"=[NHÓM 05]=","tags":["nhom05"],"category":"","content":"NHÓM 05: CÁC YẾU TỐ CẦN THIẾT CỦA CÁC GAME XẾP GẠCH HIỆN ĐẠI\n\nKhái niệm về trò chơi Tetris hay trò chơi xếp gạch \"hiện đại\" khá là mờ nhạt.\nNói chung, một game xếp gạch hiện đại thường sẽ bám sát theo Tetris Design Guideline (Bộ nguyên tắc thiết kế cho một game Tetris). Game nào thỏa mãn đa số các tiêu chí dưới đây có thể được coi là game xếp gạch hiện đại.\n\n    1. Phần có thể nhìn thấy được của bảng có kích thước 10 cột × 20 hàng, cùng với 2 - 3 hàng ẩn ở trên cùng. (Kích thước bảng thực tế ở trong mã nguồn game thường cố định ở 10 cột × 40 hàng).\n    2. Gạch mới xuất hiện ở giữa trên cùng của vùng có thể nhìn thấy (thường là ở hàng 21-22). Mỗi gạch đều có màu sắc và hướng xuất hiện mặc định riêng. Với những gạch có chiều rộng là số lẻ (Z, S, J, L, T) có thể lệch sang trái hoặc phải 1 ô khi xuất hiện.\n    3. Có một bộ xáo gạch như 7-Bag hay His được thiết kế để giảm hoặc tránh tình trạng Flood hay Drought.\n    4. Có một hệ thống xoay, và cho phép xoay theo ít nhất 2 hướng. Ưu tiên hệ thống xoay SRS hoặc các biến thể tương tự.\n    5. Có hệ thống chờ khóa gạch thích hợp.\n    6. Có cơ chế top-out thích hợp.\n    7. Có hàng NEXT hiện từ 3 - 6 gạch sắp rơi (vẫn chấp nhận trường hợp chỉ hiện 1 gạch) và những gạch trong cột này phải giống tư thế khi chúng vừa mới xuất hiện trong bảng.\n    8. Cho phép giữ gạch.\n    9. Nếu có hệ thống chờ tạo gạch hoặc hệ thống chờ xóa hàng, game thường sẽ có hệ thống IRS và IHS. Techmino còn có cả hệ thống IMS nữa (tìm trong Zictionary để biết thêm).\n    10. Có hệ thống DAS nhằm hỗ trợ các chuyển động ngang một cách chính xác và nhanh chóng.","link":"","id":"a6d527d1319e7a8f51a45e3fa5990e5126f41a8f"},{"title":"Next (Kế / Tiếp)","tags":["nhom05","preview"],"category":"term","content":"Là một hàng dùng để hiện chuỗi gạch sẽ lần lượt xuất hiện.\\n\\nCó một kỹ năng cần thiết đó là lên kế hoạch trước cách đặt các gạch từ hàng NEXT. Số lượng gạch bạn muốn lên kế hoạch là tùy thuộc vào bạn và có thể thay đổi tùy theo chế độ chơi và tình trạng bảng chơi hiện tại của bạn.","link":"","id":"c1445202fd59e609d8f5f28cb5ea4cd4ce25dcb2"},{"title":"Hold (Giữ/Trữ/Cất)","tags":["nhom05"],"category":"term","content":"Một chức năng cho phép bạn sử dụng gạch ở trong ô HOLD và cất gạch đang rơi vào ô HOLD (hoặc cất gạch hiện tại vào HOLD và sử dụng gạch ở ô đầu tiên trong hàng NEXT, nếu như chưa có gạch nào trong ô HOLD)\\n\\nBình thường, Hold chỉ có thể được sử dụng 1 lần cho mỗi gạch.\\n\\nTrên thực tế, việc dùng Hold hay không cũng có ưu nhược của nó.\\nNếu không dùng Hold:\\n\\t- Có thể giảm áp lực cho người chơi khi điều khiển gạch.\\n\\t- Đồng thời có thể giảm số phím cần nhấn trong game → có thể tăng KPS lên.\\nTrên thực tế, đã có nhiều kỷ lục 40L được xác lập mà không cần Hold.\\n\\nNếu dùng Hold:\\n\\t- Hold có thể có ích trong nhiều trường hợp khác nhau (ví dụ như khi đang chơi ở tốc độ rơi cao).\\n\\t- Cho phép người chơi có thể làm được nhiều setup phức tạp hơn mà không đẩy thêm áp lực cho người chơi.","link":"","id":"881357793e0d6c9cea55b8a5074f2393563ff4a3"},{"title":"Hold tại chỗ","tags":["nhom05","physicalhold","physics","inplacehold"],"category":"term","content":"*Chỉ có trên Techmino*\\n\\\"Giữ ngay tại chỗ\\\".\\n\\nMột kiểu Hold đặc biệt cho phép gạch được lấy ra từ ô HOLD sẽ xuất hiện ngay tại vị trí mà gạch hiện tại đang rơi (khác với Hold thông thường khi mà gạch sẽ xuất hiện ở trên cùng của bảng).\\nBạn có thể bật chức năng này trong Chế độ tự do.\\n\\nFun fact: người Trung gọi cái này là \\\"Physical Hold\\","link":"","id":"363adc4bbf70e192ffb8170c2fc99083df473d80"},{"title":"Swap (Chuyển)","tags":["nhom05","hold"],"category":"term","content":"Một biến thể khác của \\\"Hold\\\". Swap sẽ đổi gạch đang rơi với gạch tiếp theo trong NEXT. Bạn có thể bật chức năng này trong Chế độ tự do.","link":"","id":"938e3ce3a64c332521abe9ffa0564560a5c15b70"},{"title":"Game over","tags":["nhom05","topout","toppingout"],"category":"term","content":"Một tựa game xếp gạch hiện đại thường có 3 điều kiện để \"game over\":\n\n1. Block out: Gạch mới nằm chồng lên một gạch đã đặt.\n2. Lock out: Có gạch nằm hoàn toàn ở phía trên vùng nhìn thấy.\n3. Top out: Độ cao của bảng vượt quá độ cao cho phép (thường là 40 hàng). Cái này đa số là do hàng rác đẩy bảng lên quá cao.\n\nTechmino mặc định sẽ không kiểm tra điều kiện Lock out và Top out.","link":"","id":"9b7b7d7718401e411ffd358fddb44dd937e8ee7f"},{"title":"Vùng đệm","tags":["nhom05","invisible","buffer","zone"],"category":"term","content":"Tên tiếng Anh: \\\"Buffer Zone\\\". Chỉ bao gồm các hàng từ hàng 21-40 (nằm ở phía trên vùng nhìn thấy).\\n\\nTồn tại vùng này là vì sẽ có trường hợp hàng rác sẽ đẩy các hàng bên trên trong bảng ra khỏi vùng nhìn thấy (dễ thấy nhất khi dùng Center 4-Wide).\\nNhững ô gạch nào đi ra khỏi vùng nhìn thấy được sẽ đi vào vùng đệm và sẽ xuất hiện lại trong vùng nhìn thấy nếu bạn đã xóa đủ hàng.\\n\\nVùng đệm thường cao 20 ô (thường là do bảng đã bị cố định kích thước ở trong các dòng code), nhưng có game có vùng này cao vô hạn (ví dụ như trong chính Techmino luôn, khi bảng có thể tự mở rộng kích thước của nó).\\n\\nCác bạn có thể tìm hiểu thêm ở mục \\\"Vùng biến mất\\\".","link":"","id":"25fd3622f3e1c203fd3dd7e7839c3e1c3452ff74"},{"title":"Vùng biến mất","tags":["nhom05","gone","vanish","zone"],"category":"term","content":"Tên tiếng Anh: \"Vanish Zone\". Là vùng bao gồm các hàng nằm ở trên \"Vùng đệm\", thường bắt đầu từ hàng 40 trở lên.\n\nBình thường, nếu có ô gạch nào ở trong vùng này thì game sẽ kích hoạt ngay cơ chế top-out.\nTuy nhiên, mỗi game sẽ có cách xử lý khác nhau. Ví dụ:\n    - Jstris: Vùng biến mất nằm ở hàng 22 trở lên, những ô gạch nào nằm trong vùng này sẽ biến mất hoàn toàn.\n    - Tetris Online: Game sập.\n    - Puyo Puyo Tetris: Các ô gạch ở vùng biến mất sẽ sao chép lại vô số lần khi chúng quay về lại vùng nhìn thấy (nhấn vào hình địa cầu để xem ví dụ của trường hợp này).","link":"https://youtu.be/z4WtWISkrdU","id":"0cf84e1cb6e4ab493b1b0ef98b309b5aca10d57c"},{"title":">A|Gạch","tags":["nhom05a"],"category":"","content":"Bạn có biết? Techmino hỗ trợ và cho phép bạn chơi với 29 loại gạch khác nhau, bao gồm: 1 Mino, 1 Domino, 2 Trimino, 7 Tetromino và 18 Pentomino\\n\\nMino: gạch 1 ô\\nDomino: gạch 2 ô\\nTrimino: gạch 3 ô\\nTetromino: gạch 4 ô\\nPentomino: gạch 5 ô\\n\\nTechmino có Hexomino (gạch 5 ô) không?\\nBây giờ thì chưa nhưng tương lai thì có thể có.","link":"","id":"2e345161d1e73d9d8ee572d8aaea27561e221749"},{"title":"Hình dạng","tags":["nhom05a","hình","dáng`tetromino","tetramino","tetrimino"],"category":"term","content":"Trong đa số các game xếp gạch, tất cả gạch đều là Tetromino\\n\\nCó 7 loại Tetromino, nếu cho phép xoay nhưng không lật ngang hay dọc, gồm: Z, S, J, L, T, O, và I.\\nHãy xem mục \\\"Tên\\\" (Nhóm 05A) để có thêm thông tin.","link":"","id":"f07215fbff68eefeeb0bfdf906273a092cf669f5"},{"title":"Màu","tags":["nhom05a","màu`tetromino","tetramino","tetrimino"],"category":"term","content":"Nhiều game xếp gạch hiện đại, từ chính thức tới fan-made, đã và đang sử dụng cùng một bảng màu duy nhất cho Tetromino.\\n\\nNhững màu này bao gồm:\\n\\tZ - Đỏ \\n\\tS - Xanh lá \\n\\tJ - Xanh dương \\n\\tL - Cam \\n\\tT - Tím \\n\\tO - Vàng \\n\\tI - Xanh lơ\\n\\nTechmino cũng sử dụng bảng màu này để tô màu cho Tetromino.","link":"","id":"bf5bab1a1b98bb38f044caf1ffae956dbe1fceaf"},{"title":"Tên","tags":["nhom05a","mino","tên","gạch`tetromino","tetramino","tetrimino"],"category":"term","content":"Đây là danh sách gạch mà Techmino sử dụng\\n(cùng với tên tương ứng của chúng):\\n\\nTetromino:\\nZ:`CHAR.mino.Z`,  S:`CHAR.mino.S`,  J:`CHAR.mino.J`,  L:`CHAR.mino.L`,  T:`CHAR.mino.T`,  O:`CHAR.mino.O`,  I:`CHAR.mino.I`;\\n\\nPentomino:\\nZ5:`CHAR.mino.Z5`,  S5:`CHAR.mino.S5`,  P:`CHAR.mino.P`,  Q:`CHAR.mino.Q`,  F:`CHAR.mino.F`,  E:`CHAR.mino.E`,  T5:`CHAR.mino.T5`,  U:`CHAR.mino.U`,  V:`CHAR.mino.V`,  W:`CHAR.mino.W`,  X:`CHAR.mino.X`,  J5:`CHAR.mino.J5`,  L5:`CHAR.mino.L5`,  R:`CHAR.mino.R`,  Y:`CHAR.mino.Y`,  N:`CHAR.mino.N`,  H:`CHAR.mino.H`,  I5:`CHAR.mino.I5`;\\n\\nTrimino, Domino và Mino:\\nI3:`CHAR.mino.I3`,  C:`CHAR.mino.C`,  I2:`CHAR.mino.I2`,  O1:`CHAR.mino.O1.","link":"","id":"0808a868fc252ddfa6f26eff789ead614bcf5898"},{"title":"Hướng","tags":["nhom05a","0r2l","02","20","rl","lr`tetromino","tetramino","tetrimino"],"category":"term","content":"Trong hệ thống xoay SRS và các biến thể của SRS, nhiều người sử dụng một hệ thống số và chữ cái để mô tả hướng của gạch:\n    0: Hướng mặc định của hệ thống xoay\n    R: Xoay phải, góc 90° theo chiều kim đồng hồ\n    L: Xoay trái, góc 90° theo ngược chiều kim đồng hồ\n    2: Xoay 2 lần, góc 180° theo bất kì chiều nào.\n\nHệ thống mô tả cách xoay như sau:\n    - 0 → L nghĩa là xoay gạch ngược chiều kim đồng hồ, từ hướng ban đầu (0) sang hướng bên trái (L)\n    - 0 → R nghĩa là xoay gạch theo chiều kim đồng hồ, từ hướng ban đầu (0) sang hướng bên phải (R)\n    - 2 → R nghĩa là xoay gạch theo chiều kim đồng hồ, từ hướng 180° (2) sang hướng bên phải (R).","link":"","id":"b374ee5e09a4efbcf62aa46c8313024bc6ed5da4"},{"title":">B|Hệ thống xoay","tags":["nhom05b"],"category":"","content":"Một hệ thống để xác định cách gạch xoay.\n\nỞ các trò xếp gạch hiện đại, mỗi gạch có thể xoay dựa trên một tâm xoay cố định (vài game có thể không có cái này).\nNếu gạch sau khi xoay đè lên gạch khác / ra ngoài bảng, hệ thống sẽ thử \"wall-kicking\" (đẩy gạch sang các vị trí xung quanh).\nTuy nhiên, nếu khoảng cách quá lớn thì hệ thống xoay không thể đá gạch được\n\nWall-kick cho phép gạch có thể đến những lỗ có hình dạng nào đó mà bình thường không thể tiếp cận được. Các vị trí mà gạch hệ thống xoay có thể thử được chứa trong một bảng gọi là \"wall-kick table\".","link":"","id":"819ba648b62293d1dcc6001f45c2a60e90526a84"},{"title":"ARS","tags":["nhom05b","arikrotationsystem","atarirotationsystem"],"category":"term","content":"Có thể chỉ 1 trong 2 hệ thống sau:\\nArika Rotation System (Hệ thống xoay Arika): hệ thống xoay được dùng trong series game Tetris: The Grand Master.\\nAtari Rotation System (Hệ thống xoay Atari), hệ thống xoay luôn căn chỉnh các gạch ở trên cùng bên trái khi xoay.","link":"","id":"98ecc8f91fe7345e60f53ff4764b01daa1ec19b2"},{"title":"ASC","tags":["nhom05b","ascension"],"category":"term","content":"Hệ thống xoay được dùng trong Ascension (tên viết tắt cũng là ASC) - một bản clone của Tetris. Tất cả các gạch đều sử dụng chung hai bảng wall-kick đối xứng với nhau cho 2 hướng xoay và vùng đá phải nằm trong khoảng cách 2 ô ở tất cả 4 hướng.","link":"","id":"38975a865589d4c9f5039f1e827b0ed0ac5e7183"},{"title":"ASC+","tags":["nhom05b","ascension","ascplus"],"category":"term","content":"Một phiên bản được chỉnh sửa của ASC trong Techmino để hỗ trợ wall-kick khi xoay 180°.","link":"","id":"7dd7a5f78429bdb1e0bd250f4e2ad8f7adcd7774"},{"title":"BPS","tags":["nhom05b","bulletproofsoftware"],"category":"term","content":"BPS rotation system | Hệ thống xoay BPS\\nĐược dùng trong các game Tetris được viết bởi Bullet-Proof Software.","link":"","id":"00e339b72578fec63f997fb304cac9886f972083"},{"title":"BiRS","tags":["nhom05b","biasrs","biasrotationsystem"],"category":"term","content":"Bias Rotation System | Hệ thống xoay Bias.\n*Chỉ có trên Techmino*\n\nMột hệ thống xoay dựa trên SRS và XRS\n\nĐể kích hoạt offset bổ sung trong BiRS, cần phải thỏa hai điều kiện sau cùng lúc:\n1. Một nút di chuyển (Trái / Phải / Thả nhẹ) phải được giữ\n2. Gạch hiện tại phải chạm một ô gạch bất kỳ hoặc chạm tường ở hướng đang được giữ ở bước 1\n\nNếu thực hiện thành công, offset ở hướng đang được giữ ở bước 1 sẽ được thêm 1 ô. Tuy nhiên, để kick được thì cần phải tuân thêm hai điều kiện:\n\n1. Khoảng cách Euclide từ tâm tới vị trí đá tới được chọn phải bé hơn √5\n2. Hướng của cú đá không phải là hướng đối diện với hướng đã được xác định bằng phím bấm.\n\nNếu không dùng kick đó được, offset trái phải sẽ bị hủy và thử lại, nếu không được nữa thì hủy luôn offset dưới.\n\nSo với XRS, BiRS dễ nhớ hơn vì chỉ dùng một bảng wall-kick; nhưng vẫn giữ được khả năng vượt địa hình của SRS.","link":"","id":"8d475ec12766385240234b0522833caf465ae0b5"},{"title":"C2RS","tags":["nhom05b","c2rs","cultris2"],"category":"term","content":"Cultris II rotation system | Hệ thống xoay Cultris II\\n\\nMột hệ thống xoay ở trong Cultris II - một bản clone của Tetris.\\nToàn bộ gạch và cả hướng xoay đều sử dụng chung một bảng wall-kick (trái 1, phải 1, dưới 1, dưới trái 1, dưới phải 1, trái 2 và phải 2) và phía bên trái được ưu tiên hơn so với bên phải.\\n\\nTrong Techmino có một bản chỉnh sửa của hệ thống này, đó là C2sym.","link":"","id":"6c60d2cdda7d3c08f9c6f9d92dfca2bb9b20e22d"},{"title":"C2sym","tags":["nhom05b","cultris2"],"category":"term","content":"Một bản chỉnh sửa của C2RS trong Techmino. Hệ thống sẽ ưu tiên hướng trái hoặc phải tùy vào hình dạng của các viên gạch khác nhau.","link":"","id":"4c5ae6a71c25388d1ed0fdeb74ac9d13738ade68"},{"title":"DRS","tags":["nhom05b","dtetrotationsystem"],"category":"term","content":"DTET Rotation System | Hệ thống xoay DTET\\nHệ thống xoay trong DTET.","link":"","id":"d8d40a4a8b77492da839f3ee647026de2721ecc6"},{"title":"NRS","tags":["nhom05b","nintendorotationsystem"],"category":"term","content":"Nintendo Rotation System | Hệ thống xoay Nintendo\\n\\nHệ thống được sử dụng trong các game Tetris cho hai hệ máy Nintendo Entertainment System (NES) và Game Boy.\\nHệ thống xoay này có hai phiên bản ngược chiều nhau. Trên Game Boy thì gạch sẽ căn về phía bên trái, còn NES thì gạch sẽ căn về phía bên phải.","link":"","id":"cd91f84e27c1c96a586b2fc5345d494597a6b9e4"},{"title":"SRS","tags":["nhom05b","superrotationsystem"],"category":"term","content":"Super Rotation System | Hệ thống xoay Siêu Cấp\\n\\nHệ thống xoay này được sử dụng rất nhiều trong các game xếp gạch hiện đại và có rất nhiều hệ thống xoay do fan làm ra cũng dựa vào hệ thống này.\\nCó tất cả 8 bảng wall-kick trong SRS, tương ứng với hai hướng xoay cho tất cả bốn tư thế của tất cả các gạch (không có trường hợp cho 180°). Nếu gạch đụng tường, đụng đáy, hay đè lên gạch khác sau khi xoay, hệ thống sẽ kiểm tra các vị trí xung quanh.\\n\\nBạn có thể xem đầy đủ các bảng wall-kick của SRS trên Tetris Wiki.","link":"","id":"50484d19bf5873ad145d5d950a0d620a065cf385"},{"title":"SRS+","tags":["nhom05b","srsplus","superrotationsystemplus"],"category":"term","content":"Một biến thể của SRS để thêm hỗ trợ wall-kick khi xoay 180°.","link":"","id":"e3b3a98396f109df26f4d44777870a9989a74866"},{"title":"TRS","tags":["nhom05b","techminorotationsystem"],"category":"term","content":"Techmino Rotation System | Hệ thống xoay Techmino\\n*Chỉ có trên Techmino*\\n\\nMột hệ thống xoay dựa trên SRS.\\nHệ thống này khắc phục được hiện tượng gạch S / Z bị kẹt trong một số trường hợp.\\n\\nHơn nữa, TRS có thêm các bảng wall-kick dành cho Pentomino dựa trên logic của SRS với Tetromino.\\n\\nHệ thống cũng hỗ trợ O-Spin, cho phép gạch O có thể đá hoặc \\\"biến hình\\\".","link":"","id":"4b869ed5e64eed946f0d8d4ee3ff53da60539f0b"},{"title":"XRS","tags":["nhom05b","xrs"],"category":"term","content":"X rotation system | Hệ thống xoay X, một hệ thống xoay trong T-ex.\\n\\nỞ trong các hệ thống khác, bảng wall-kick là cố định, nên gạch chỉ có thể bị đá ra một hướng (và hướng đó có thể không phải là hướng mà người chơi muốn). XRS giải quyết vấn đề nan giải này bằng cách cho phép người chơi giữ phím di chuyển (Trái / Phải / Thả nhẹ) để hệ thống ưu tiên theo hướng đó. Điều đó làm cho việc điều khiển hướng đi của gạch sau khi wall-kick của người chơi dễ dàng hơn.","link":"","id":"8313913e9f2100a15d29fc661f0bf3e043c2ac35"},{"title":">C|Hệ thg đ.khiển","tags":["nhom05c"],"category":"","content":"NHÓM 5C: HỆ THỐNG ĐIỀU KHIỂN","link":"","id":"d2f6a01e025c3491115f573968646a84f36d4e7e"},{"title":"IRS","tags":["nhom05c","initialrotationsystem"],"category":"term","content":"Initial Rotation System\\nCho phép bạn giữ phím xoay trong lúc chờ tạo gạch (spawn delay) để gạch được xoay sẵn lúc xuất hiện. Việc này có thể giúp bạn thoát chết trong một vài tình huống.","link":"","id":"6eb922490b4344c5aa99427d8d17aca5790e5b82"},{"title":"IHS","tags":["nhom05c","initialholdsystem"],"category":"term","content":"Initial Hold System\\nCho phép bạn giữ phím Hold trong lúc chờ tạo gạch (spawn delay) để thay gạch sắp tới bằng gạch trong HOLD. Việc này có thể giúp bạn thoát chết trong một vài tình huống.","link":"","id":"2651cd73fca2dd2cf48f14dd9a01b7c3e14a0e77"},{"title":"IMS","tags":["nhom05c","initialmovesystem"],"category":"term","content":"Initial Movement System\\n*Chỉ có trên Techmino*\\n\\nCho phép bạn giữ một phím di chuyển trái phải trong lúc chờ tạo gạch (spawn delay) để gạch xuất hiện cách chỗ ban đầu 1 ô theo hướng được giữ. Việc này có thể giúp bạn thoát chết trong một vài tình huống.\\nLưu ý: DAS buộc phải được \\\"nạp đầy\\\" trước khi gạch xuất hiện.","link":"","id":"737e54d1f4d8cba7da621c8b9fb8d295ac1592d2"},{"title":">D|Các kiểu xáo","tags":["nhom05d"],"category":"","content":"","link":"","id":"b2bc4b4f7d39aa5c345be88a8556a4a9be3aa36a"},{"title":"Túi 7","tags":["nhom05d","bag7","randomgenerator","túi","7","gạch;","kiểu","xáo","túi","7","gạch"],"category":"term","content":"Tên gọi chính thức là \\\"Random Generator\\\" (Trình xáo gạch ngẫu nhiên) hay \\\"7-Bag Generator\\\" (Kiểu xáo Túi 7 gạch).\\nĐây là kiểu xáo hay được sử dụng bởi đa số các xếp gạch hiện đại.\\n\\nChuỗi gạch sẽ được chia thành các nhóm (túi). Mỗi túi gạch đều có dủ 7 Tetromino nhưng trình tự thì ngẫu nhiên.\\nMột vài ví dụ về chuỗi gạch: ZSJLTOI, OTSLZIJ, LTISZOJ.\\n\\nKiểu xáo này cho phép ngăn chặn tình trạng sự xuất hiện không đồng đều của các viên gạch.","link":"","id":"3b4c086a01c9e03a74b44c6cc095c55240b3b5db"},{"title":"His","tags":["nhom05d","historygenerator","hisgenerator"],"category":"term","content":"Một kiểu xáo gạch được sử dụng nhiều trong series game Tetris: The Grand Master.\n\nTrong kiểu xáo này, cách chọn gạch diễn ra như nhau:\n    - Bước 1: Chọn ngẫu nhiên một trong bảy Tetromino.\n    - Bước 2: Kiểm tra xem liệu gạch đã bốc trúng có phải là một trong những gạch đã xuất hiện gần nhất không.\n        <i class='not-italic text-cyan-500 text-4xl icon checkMark'></i>: Tới Bước 3\n        <i class='not-italic text-cyan-500 text-4xl icon crossMark'></i>: Nhảy tới Bước 4\n    - Bước 3: Cộng 1 vào số lần đã bốc lại, kiểm tra xem liệu số lần đã bốc lại có vượt qua giới hạn tối đa hay không?\n        <i class='not-italic text-cyan-500 text-4xl icon checkMark'></i>: Tới Bước 4\n        <i class='not-italic text-cyan-500 text-4xl icon crossMark'></i>: Nhảy về Bước 1\n    - Bước 4: Dùng gạch đã bốc trúng\n\nKiểu xáo này hay được mô tả bằng \"His [A] Roll [B]\"\nTrong đó:\n    - Nhớ A gạch đã xuất hiện gần nhất.\n    - Chỉ có thể bốc lại tối đa B lần.\nVí dụ: His4 Roll6\n    - Nhớ 4 gạch xuất hiện gần nhất.\n    - Chỉ có thể bốc lại tối đa 6 lần.\n\nTrong Techmino, số lần bốc lại gạch bằng một nửa số gạch đã kiểm tra của kiểu/hệ thống xáo.\n\nKiểu xáo His là phiên bản cải tiến so với kiểu xáo ngẫu nhiên đơn giản và giảm tình trạng chuỗi S và Z liên tục.","link":"","id":"b2535f013370b62d60bca9036014dec7129b43f7"},{"title":"HisPool [1/2]","tags":["nhom05d","hispool","historypoolgenerator","kiểu","xáo","hispool"],"category":"term","content":"Một biến thể của kiểu xáo gạch His.\\n\\nĐi kèm với cơ chế \\\"Pool\\\" (Rổ) dựa trên những gạch đã xuất hiện gằn nhất,cho phép gạch chưa được xuất hiện quá lâu có cơ hội xuất hiện cao hơn.\\n\\nKiểu xáo này giúp ổn định chuỗi gạch và đảm bảo rằng flood & drought không xảy ra quá lâu.\\n\\nĐộ ổn định của kiểu xáo này tùy thuộc vào chuỗi gạch gần nhất và túi gạch.","link":"","id":"cbc16ce2bca92a2920d40e6f441f33ee8e69a685"},{"title":"HisPool [2/2]","tags":["nhom05d","hispool","historypoolgenerator","kiểu","xáo","hispool"],"category":"term","content":"[Sea: Phần này không có trong Zictionary ngôn ngữ khác!]\nCách hoạt động của kiểu xáo HisPool diễn ra tuần tự như sau:\n\nBước 1: Lấy một viên gạch ngẫu nhiên trong cái Rổ.\n    - Kiểm tra xem gạch vừa bốc có nằm trong số gạch đã chọn hay không?\n        <i class='not-italic text-cyan-500 text-4xl icon crossMark'></i>: Chọn gạch vừa bốc và tới bước 2\n        <i class='not-italic text-cyan-500 text-4xl icon checkMark'></i>: Lặp lại bước 1 cho tới khi thỏa một trong hai điều kiện sau:\n            -- Gạch vừa bốc không nằm trong số gạch đã chọn gần nhất.\n            -- Hết lượt bốc lại\n        Sau khi hết lặp, chọn gạch được bốc trúng gần nhất.\n\nBước 2: Gạch được bốc trúng sẽ được lấy ra khỏi Rổ.\n    - Với mỗi gạch còn lại, cộng 1 vào số lần chưa bốc trúng.\n    - Rổ lúc này còn 34 gạch.\n\nBước 3: Thêm gạch có số lần chưa bốc trúng nhiều nhất vào lại rổ (để đảm bảo số lượng là 35 gạch), và đặt lại số lần chưa bốc trúng của nó về 0\n\nBước 4: Thêm gạch đã chọn vào chuỗi NEXT cũng như chuỗi gạch đã chọn gần nhất, rồi quay về Bước 1.","link":"","id":"f98f66575271a2989f97a33b77f47af0d909864e"},{"title":"bagES","tags":["nhom05d","bages","easy","start","khởi","đầu","suôn","sẻ;","kiểu","xáo","ez-start;","kiểu","xáo","ezstart"],"category":"term","content":"*Chỉ có trên Techmino*\\nTên khác: EZ-Start generator (Khởi đầu suôn sẻ)\\n\\nMột biến thể của kiểu xáo Túi. Gạch đầu tiên của mỗi túi sẽ không bao giờ là gạch khó đặt: S / Z / O / S5 / Z5 / F / E / W / X / N / H.","link":"","id":"937f6f594fcecb9a3a8197474434027026e3a99f"},{"title":"Reverb","tags":["nhom05d","kiểu","xáo","reverb"],"category":"term","content":"*Chỉ có trên Techmino*\\nMột biến thể của kiểu xáo Túi. \\n\\nKiểu xáo Reverb sẽ lặp ngẫu nhiên một vài gạch từ kiểu xáo Túi. Xác suất lặp lại gạch giảm nếu gạch đã xuất hiện và ngược lại\\nSố lần lặp lại trên lý thuyết nằm từ 0 tới 6","link":"","id":"0ae080977469261426fbace816ec510381ac6b52"},{"title":"C2","tags":["nhom05d","cultris2generator","cultrisiigenerator","c2generator"],"category":"term","content":"Đây là kiểu xáo được dùng trong Cultris II với cách hoạt động như sau:\\n\\nBước 1. Ban đầu toàn bộ Tetromino sẽ có trọng số (\\\"weight\\\") là 0.\\n\\nBước 2. Cứ sau mỗi lần xáo gạch, toàn bộ trọng số của các gạch sẽ bị chia hết cho 2, và được cộng một số thực ngẫu nhiên từ 0 tới 1.\\n\\nBước 3. Gạch có trọng số cao nhất, và sau đó trọng số của nó sẽ bị chia cho 3.5.\\n\\nBước 4: Về Bước 2 và tiếp tục lặp lại","link":"","id":"f09f1cf6b521d304e32fd5a82ef69a1427482bdf"},{"title":"H. tg. Drought","tags":["drought"],"category":"term","content":"Hiện tượng gạch người chơi đang rất cần nhưng lại không xuất hiện trong thời gian quá dài. Thường dùng để chỉ hiện tượng khát gạch I trong mấy game cổ điển vì chúng thường dùng bộ xáo gạch ngẫu nhiên đơn giản.\\n\\nHiện nay, ở các game hiện đại, hiện tượng drought không thể xảy ra vì khoảng cách tối đa giữa 2 gạch cùng loại là 13 gạch.","link":"","id":"e13718d61cc5f332753ab13eb091082977358060"},{"title":">E|Thông số","tags":["nhom05e"],"category":"","content":"","link":"","id":"f0ed0cd42a5bdabd85414b6d3fb1049fe8b83b6c"},{"title":">E1|Thg số game","tags":["nhom05e1"],"category":"","content":"NHÓM 5E1: THÔNG SỐ GAME","link":"","id":"1fac7af85f77a298fb0f5f35f4d9363269ad0a52"},{"title":"Tốc độ rơi","tags":["nhom05e1","trọng","lực","falling","speed","gravity"],"category":"term","content":"Tốc độ gạch rơi xuống. Đơn vị là \"G\".\nChỉ số hàng gạch rơi xuống trong một khung hình.\nCon số này luôn đi kèm với giả thiết là game đang chạy ở 60FPS.\n\nVí dụ: gạch di chuyển xuống 1 ô / 60 khung hình (1 ô / giây) thì tốc độ rơi là ¹⁄₆₀ G\n\nTốc độ tối đa của game xếp gạch hiện đại là 20G (bởi vì có 20 hàng trong vùng nhìn thấy được).\n\nTrong Techmino, tốc độ còn được biểu diễn ở dạng số khung hình gạch cần để đi xuống 1 ô.\n60 ở hệ thống đó tương đương với 1 ô / 1 giây hoặc 1G.\n\nTrong thực tiễn, \"20G\" không chỉ \"20 ô / giây\" mà chỉ \"Tốc độ tối đa\"\nXem mục tiếp theo để biết thêm.","link":"","id":"4fa0dd27621093a67b273ed0117727062b38e3d0"},{"title":"20G","tags":["nhom05e1","trọng","lực;","ngay","lập","tức;","gravity","instantly"],"category":"term","content":"Tốc độ tối đa trong các game xếp gạch hiện đại.\\n\\nMặc dù nhìn qua thuật ngữ này thể hiện tốc độ rơi là 20 hàng / khung hình, nhưng thật ra chúng được dùng để chỉ tốc độ vô tận.\\n\\nHơn nữa, trong các chế độ 20G, game sẽ ưu tiên di chuyển gạch xuống đáy hơn là bất cứ thao tác di chuyển nào từ người chơi.\\nVà ngay cả khi ARR được đặt là 0, gạch vẫn cứ di chuyển một mạch xuống phía dưới một cách hồn nhiên giống như người chơi chưa nhấn gì, trước khi di chuyển theo thao tác của người chơi.\\n\\nViệc này gây khó khăn cho người chơi khi họ muốn gạch leo ra khỏi hố hoặc nhảy ra khỏi lỗ trong một số tình huống.","link":"","id":"8681d2c5bd8d94b500987831b496b228056ab1c8"},{"title":"Lockdown Delay","tags":["nhom05e1","lockdelay","lockdowndelay","lockdowntimer","ld;","thời","gian","chờ","khóa","gạch"],"category":"term","content":"Thời gian chờ khóa gạch, viết tắt là LD.\\nGame sẽ chờ một khoảng thời gian, trước khi game khóa gạch (tức là gạch không thể điều khiển được nữa), bắt đầu tính từ khi gạch vừa chạm đất.\\n\\nTrong các game xếp gạch cổ điển, khoảng thời gian chờ này CHÍNH LÀ khoảng thời gian gạch cần có để di chuyển xuống 1 ô, và không có cách nào để hoãn thời điểm khóa gạch.\\n\\nTrong các game xếp gạch hiện đại, thời gian chờ được tính riêng và thoải mái hơn. Đi kèm với thời gian chờ dài hơn là cơ chế hoãn thời điểm khóa gạch, trong đó bạn có thể di chuyển hoặc xoay gạch để đặt lại bộ đếm thời gian về 0, để bạn có thể hoãn thời điểm khóa gạch thêm một lúc nữa (tối đa 15 lần trong hầu hết các game).","link":"","id":"47e0480e0439e28dab3a007a21fd9f154e2b2cea"},{"title":"Spawn&ClearDelay","tags":["nhom05e1","spawndelay","cleardelay;","thời","gian","chờ","gạch","sinh","ra;","thời","gian","chờ","xóa","hàng"],"category":"term","content":"Spawn Delay (Thời gian chờ gạch sinh ra): Khoảng thời gian từ lúc gạch bị khóa cho tới khi gạch mới được sinh ra.\\n\\nLine Clear Delay (Thời gian chờ xóa hàng): Thời gian để hiệu ứng xóa hàng thực hiện xong.","link":"","id":"7ffaa94f81a2a82dd1aed3fbf74669ab44dee315"},{"title":"ARE","tags":["nhom05e1","spawn","appearance","delay"],"category":"term","content":"Thời gian chờ xuất hiện gạch mới\\nHay còn được biết với tên: Appearance Delay và Entry Delay.\\n\\n\\\"ARE\\\" chỉ khoảng thời gian sau khi gạch bị khóa và trước khi gạch mới xuất hiện\\n\\nP/s: Từ \\\"ARE\\\" không phải là từ viết tắt hay hay là một dạng của động từ \\\"be\\\" trong tiếng Anh; nó bắt nguồn từ <あれ> (a-re) trong tiếng Nhật, có nghĩa là \\\"nó\\\" hoặc \\\"cái đó\\\" / \\\"cái kia\\\" / \\\"cái ấy\\\".","link":"","id":"03ffa3c523008f6619e534f3db9d67858a2147ce"},{"title":"Line ARE","tags":["nhom05e1","appearance","delay"],"category":"term","content":"Khoảng thời gian khi hiệu ứng xóa hàng bắt đầu chạy cho tới khi gạch mới xuất hiện.","link":"","id":"27adf9cafe44613ca1c7c529059e38cfc447575b"},{"title":"Death ARE","tags":["nhom05e1","die","delay"],"category":"term","content":"Một cơ chế đặc biệt cho phép tránh game over trong một số trường hợp.\\n\\nDeath ARE sẽ được kích hoạt khi có một viên gạch chặn ngay tại vị trí xuất hiện của gạch mới (dẫn tới hiện tượng block out)\\nKhi kích hoạt, spawn ARE sẽ được cộng với Death ARE để cho phép người chơi có cơ hội dùng IRS, IHS và IMS.\\n\\nÝ tưởng về cơ chế này được đề xuất lần đầu bởi @NOT_A_ROBOT.","link":"","id":"d1652106882389aa309816bdf09c8209a8949c1a"},{"title":">E2|Thg số đ.khiển","tags":["nhom05e2"],"category":"","content":"NHÓM 5E2: THÔNG SỐ ĐIỀU KHIỂN","link":"","id":"e9702fe1281378567f72ce2f48bb9e21e678308e"},{"title":"DAS&ARR (dễ hiểu)","tags":["nhom05e2","das","delayedautoshift"],"category":"term","content":"Tưởng tượng bạn đang gõ chữ, và bạn nhấn giữ phím \\\"O\\\".\\nVà bạn sẽ nhận được một chuỗi toàn là o.\\n\\nỞ trên thanh thời gian thì nó trông như thế này: o-----o-o-o-o-o-o-o-o-o…\\n\\\"-----\\\" là DAS, còn \\\"-\\\" là ARR.","link":"","id":"e3513dfbe35a202109b4e533059a6049e50348e9"},{"title":"DAS & ARR","tags":["nhom05e2","das","và","arr","delayedautoshift","autorepeatrate"],"category":"term","content":"DAS, hay Delayed Auto-shift, đây là khoảng thời gian ngay sau khi gạch đã di chuyển sang 1 ô và gạch đang đợi thời điểm gạch có thể bắt đầu quá trình di chuyển tự động.\\n\\nARR, hay Auto-Repeat Rate, chỉ khoảng cách thời gian giữa 2 lần di chuyển tự động 1 ô khi gạch đang trong quá trình di chuyển tự động.\\n\\nDAS và ARR được tính bằng f (khung hình) (¹/₆₀ ở 60FPS). 1ms = 16²/₃ khung hình.","link":"","id":"8fe08fc5e100f294a74ad323c4d8d8533a8574dd"},{"title":"DAS cut","tags":["nhom05e2","dascut","dcd"],"category":"term","content":"Là cơ chế đặc biệt sẽ được kích hoạt khi gạch mới xuất hiện. Khi kích hoạt, cơ chế này sẽ tăng DAS lên một chút để gạch không tự di chuyển ngay khi đang có phím được giữ.\\n\\nCác game khác có thể có tính năng tương tự nhưng cách hoạt động có thể khác nhau.","link":"","id":"e579713b7f1d912483cfe2351132762e2a75c28d"},{"title":"IRS cut","tags":["irscut","icd"],"category":"term","content":"Là cơ chế đặc biệt sẽ được kích hoạt khi gạch mới xuất hiện nhưng không có entry delay. Khi kích hoạt, game sẽ hoãn việc kích IRS một lúc để bạn có thời gian nhả phím xoay sau khi thả gạch xong.","link":"","id":"ff95e356ce9e005c69d4c8dd445ce2935914ac87"},{"title":"Auto-lock cut","tags":["nhom05e2","autolockcut"],"category":"term","content":"Một tính năng trong Techmino cho phép ngăn chặn việc misdrop khi gạch mới vừa xuất hiện. Nút Thả mạnh sẽ bị tắt trong một khoảng thời gian ngắn sau khi gạch trước đó bị khóa.\\n\\nCác game khác có thể có tính năng tương tự nhưng cách hoạt động có thể khác nhau.","link":"","id":"de8acc2343af07a8a5434e61476f0e4209d3a4ec"},{"title":"SDF","tags":["nhom05e2","softdropfactor"],"category":"term","content":"Soft Drop Factor (Hệ số tốc độ rơi nhẹ)\\n\\nMột cách để xác định tốc độ gạch rơi khi nhấn phím \\\"Thả nhẹ\\\". Hầu hết các game xác đinh tốc độ rơi bằng công thức: Tốc độ thả nhẹ = SDF × 20\\n\\nTuy nhiên trong Techmino, tốc độ thả nhẹ là cố định với thông số SDARR (ARR nhưng dành cho nút \\\"thả nhẹ\\\").","link":"","id":"788a1286bf47d09b01ba806d1fc8deea24c76125"},{"title":">F|Điều khiển","tags":["nhom05f"],"category":"","content":"","link":"","id":"d3d553dc2cad800b0d93465b6ba44909603d8246"},{"title":">F1|Tốc độ đ.khiển","tags":["nhom05f1"],"category":"","content":"NHÓM 5F1: TỐC ĐỘ ĐIỀU KHIỂN","link":"","id":"0fde8d1952e33e368e9f4e445db75c549c650273"},{"title":"LPM","tags":["nhom05f1","linesperminute;","số","hàng","mỗi","phút;","tốc","độ"],"category":"term","content":"Lines per minute | Số hàng mỗi phút\\nPhản ánh tốc độ chơi.\\n\\nMỗi game có cách tính LPM khác nhau. Ví dụ như, Tetris Online tính LPM dựa trên PPS (nhìn mục ở bên dưới), trong đó 1 PPS = 24 LPM; do đó số hàng rác sẽ không được tính vào LPM và làm cho LPM lệch đi so với nghĩa đen của nó. Trong Techmino, giá trị LPM theo cách tính đó gọi là \\\"L'PM\\","link":"","id":"e3cc520818475699fa7b086cc6ff171869c8eccd"},{"title":"PPS","tags":["nhom05f1","piecespersecond","số","gạch","mỗi","giây;","tốc","độ"],"category":"term","content":"Pieces per second | Số gạch mỗi giây\\nPhản ánh tốc độ chơi.","link":"","id":"e1a50a861bf3c4997a0d8b725d61088d0570c198"},{"title":"BPM","tags":["nhom05f1","blocksperminute","piecesperminute","số","gạch","mỗi","phút;","tốc","độ"],"category":"term","content":"Blocks per minute | Số gạch mỗi phút\\nPhản ánh tốc độ chơi.\\n\\nNgoài ra chúng được gọi là PPM (để tránh nhầm lẫn với một thuật ngữ trong âm nhạc) (P là viết tắt của từ Pieces).","link":"","id":"d648e2d19a3206ee9625de8b4316674b46725b86"},{"title":"KPM","tags":["nhom05f1","keysperminute","keypressesperminute","số","lần","nhấn","mỗi","phút;","số","phím","mỗi","phút"],"category":"term","content":"Keypresses per minute | Số lần nhấn mỗi phút\\nPhản ánh tốc độ người chơi nhấn phím hoặc nút.","link":"","id":"e4cc846ad96dcf34f987d76fde3742444ddb1d54"},{"title":"KPP","tags":["nhom05f1","số","lần","nhấn","mỗi","gạch;","số","phím","mỗi","gạch"],"category":"term","content":"Keypresses per piece | Số lần nhấn mỗi viên gạch\\nPhản ánh mức độ hiệu quả việc điều khiển gạch.\\n\\nCó thể giảm con số này bằng cách học Finesse","link":"","id":"26ed74540242675a0d1574829ceb1c8067fc7f57"},{"title":">F2|K.th. đ.khiển","tags":["nhom05f2"],"category":"","content":"NHÓM 5F2: KỸ THUẬT ĐIỀU KHIỂN","link":"","id":"75b049eddb453d215cb2b2a8d8149cf5fad9e96e"},{"title":"Finesse","tags":["nhom05f2","finesse","lỗi","di","chuyển"],"category":"term","content":"Là kỹ thuật điều khiển gạch nhanh nhất với chuỗi phím ngắn nhất có thể nhưng vẫn đảm bảo chính xác, giúp tiết kiệm thời gian và giảm khả năng misdrop.\n\nĐây là một kỹ năng quan trọng nên bạn hãy học Finesse sớm nhất có thể. Bạn có thể thấy nhiều video hướng dẫn trên Youtube cũng như các trang hướng dẫn với hình minh họa trên Google. Hãy bắt đầu từ thứ cơ bản nhất, rồi luyện tập dần để tăng độ chính xác lên. Hãy nhớ ưu tiên chính xác hơn là tốc độ nhé.\n\nBạn sẽ không bị mất Finesse khi bạn nhét gạch hay thực hiện Spin vì Techmino chỉ kiểm tra những vị trí không yêu cầu soft drop\n\nTechmino cũng có finesse rate (%) (tỉ lệ *không* mắc lỗi di chuyển), được tính như sau:\n    - 100% (Perfect) khi số lần nhấn phím bằng hoặc ít hơn mức chuẩn\n    - 50% (Great) khi số lần nhấn phím cao hơn mức chuẩn 1 phím\n    - 25% (Bad) khi số lần nhấn phím cao hơn mức chuẩn 2 phím\n    - 0% (Miss) khi số lần nhấn phím cao hơn mức chuẩn 3 phím\nMột Bad hoặc Miss sẽ phá combo finesse.\n\nLưu ý:\n    - Finesse thường sẽ không được tính trong một vài tình huống như tốc độ rơi cao, phải sử dụng thả nhẹ hay bảng rất cao. Tuy nhiên, bộ đếm finesse của Techmino vẫn chạy bất chấp ở điều kiện nào (kể cả tốc độ rơi cao như 20G). Do vậy finesse rate thường sẽ không mang ý nghĩa gì trong trường hợp này.\n    - Bạn sẽ không bị mất Finesse khi bạn nhét gạch hay thực hiện Spin vì Techmino chỉ kiểm tra những vị trí không yêu cầu soft drop","link":"","id":"79325e0092ff0d1702a8882c9012013876eb53cd"},{"title":"Hypertapping","tags":["nhom05f2","hypertapper","nhấn","liên","tục"],"category":"term","content":"Hypertapping (Nhấn liên tục)\\n\\nĐề cập tới một kỹ năng là khi bạn rung tay liên tục thay vì giữ phím.\\n\\nTrong các game xếp gạch cổ điển, thông số DAS rất cao và không thể điều chỉnh được, dẫn tới nhấn nút liên tục sẽ nhanh hơn so với giữ phím.\\nBây giờ thì không cần vì các game xếp gạch hiện đại đã có DAS và ARR có thể điều chỉnh được (nếu có chăng không điều chỉnh được thì DAS cũng đã thấp hơn nhiều so với ngày trước).\\n\\nNhững người dùng kỹ năng này được gọi là \\\"hypertapper\\","link":"","id":"a15308690ad03261cd1735e257380b883ad512a5"},{"title":"Rolling","tags":["nhom05f2"],"category":"term","content":"Một phương pháp khác để di chuyển nhanh ở chế độ trọng lực cao (khoảng 1G) (với cài đặt DAS / ARR chậm).\n\nĐể thực hiện thao tác rolling:\n    - Cố định ngón tay của bạn trên phím bạn muốn nhấn ở một bên tay\n    - Sau đó dùng các ngón tay ở bên kia gõ mạnh liên tục ở mặt sau của tay cầm.\n\nPhương pháp này nhanh hơn nhiều so với việc nhấn liên tục (xem mục \"Hypertapping\" để biết thêm thông tin) và yêu cầu ít công sức hơn.\nPhương pháp này lần đầu tiên được tìm thấy bởi Cheez-fish - người đã đạt tốc độ nhấn lên tới 20 Hz.","link":"","id":"a70637d6abe22dff0b619bb2abbd8ef174af94d2"},{"title":">F3|Độ trễ input","tags":["nhom05f3","input","delay"],"category":"","content":"Độ trễ đầu vào\\n\\nBất kỳ thiết bị đầu vào cũng cần một khoảng thời gian để tín hiệu có thể tới game, không cao thì thấp, từ mấy ms đến cả trăm ms.\\n\\nNếu độ trễ đầu vào quá cao, thì việc điều khiển sẽ không thoải mái.\\n\\nĐộ trễ này thường do phần cứng và phần mềm, thứ mà bạn gần như không kiểm soát được. Hiệu ứng này dễ thấy nhất ở trong các game như Tetris Online hay Tetris Effect.\\n\\nBật chế độ Hiệu suất cao (Performance mode) hoặc tắt chế độ tiết kiệm năng lượng (Energy saving), đồng thời bật chế độ Gaming trên màn hình máy tính / TV, có thể giúp giảm độ trễ.","link":"","id":"415973ec170a21f3a5716074e64b6dda4b64b814"},{"title":">G|K.năng t.công","tags":["nhom05g"],"category":"","content":"NHÓM 5G: KHẢ NĂNG TẤN CÔNG","link":"","id":"4236ad60e4bc425f8c8f0d0e3c76998d0327de14"},{"title":"APM","tags":["nhom05g","attackperminute;","số","hàng","tấn","công","mỗi","phút;","số","hàng","tấn","công","trong","một","phút"],"category":"term","content":"Attack per minute\\n\\tSố hàng tấn công trung bình mà một người chơi có thể tạo ra mỗi phút (bất kể đó là đòn tấn công hoặc chỉ dùng để hủy đòn tấn công của đối thủ)\\n\\nPhản ánh sức mạnh tấn công của người chơi","link":"","id":"6022efe3e5413aff247effdbd6b9beff6acddc3c"},{"title":"SPM","tags":["nhom05g","linessentperminute;","số","hàng","gửi","mỗi","phút;","số","hàng","gửi","trong","một","phút."],"category":"term","content":"[lines] Sent per minute\\n\\tSố hàng tấn công trung bình mà được gửi vào đối thủ trong một phút.\\n\\nPhản ánh sức mạnh tấn công \\\"thực tế\\\" của người chơi (không tính các hàng dùng để chặn rác tới).","link":"","id":"819603c983a57b88fa74cb8e126b6fc6574511df"},{"title":"DPM","tags":["nhom05g","digperminute","defendperminute","số","hàng","đào","xuống","mỗi","phút;","số","hàng","đào","xuống","trong","một","phút"],"category":"term","content":"Dig / Defend per minute\\n\\tSố hàng đào xuống trung bình mỗi phút\\n\\nĐôi khi có thể phản ánh mức độ sống sót của người chơi khi nhận được rác","link":"","id":"716ee4961bcaefaa1882ab2a13c501c75dfd604f"},{"title":"RPM","tags":["nhom05g","receive;","receiveperminute;","số","hàng","rác","phải","nhận","mỗi","phút;","số","rác","phải","nhận","mỗi","phút;","số","hàng","rác","phải","nhận","trong","một","phút;","số","rác","phải","nhận","trong","mỗi","phút"],"category":"term","content":"[lines] Receive per Minute\\n\\tSố hàng rác trung bình nhận được mỗi phút\\n\\nPhản ánh áp lực hiện có của người chơi phải chịu ở một mức độ nào đó.","link":"","id":"576848e5d786490aacbbdb638bc3b0a1ae79bc35"},{"title":"ADPM","tags":["nhom05g","attackdigperminute","vs;","số","hàng","tấn","công","và","đào","xuống","mỗi","phút;","số","hàng","tấn","công","và","đào","xuống","mỗi","phút"],"category":"term","content":"Attack & Dig per minute\\n\\tSố hàng tấn công & đào xuống trung bình mỗi phút\\n\\nDùng để so sánh sự khác nhau về kỹ năng của hai người chơi trong cùng một trận đấu; chính xác hơn một chút so với APM\\n\\nVS Score (điểm VS) trong TETR.IO chính là ADPM mỗi 100 giây","link":"","id":"658315e4e9d18aea6ee5a60fcfe6adfa4ec8ea83"},{"title":"APL","tags":["nhom05g","attackperline","efficiency;","số","hàng","tấn","công;","số","hàng","đã","xóa;","độ","hiệu","quả"],"category":"term","content":"Attack per line (cleared)\\n\\tSố hàng tấn công / Số hàng đã xóa\\n\\nCòn được biết với tên \\\"efficiency\\\" (độ hiệu quả). Phản ánh độ hiệu quả khi tấn công sau mỗi lần xóa hàng.\\nVí dụ Tetris và T-spin có độ hiệu quả cao hơn so với xóa 2 / 3 hàng.","link":"","id":"f7f2c409272ce792ba2ea214402cbf70b7662c2d"},{"title":"Tấn công&Phg thủ","tags":["nhom05g","attacking","defending","phòng","thủ;","tấn","công","&","phòng","thủ;","tấn","công","và","phòng","thủ"],"category":"term","content":"Tấn công: Gửi hàng rác tới đối thủ bằng cách gửi nhiều hàng.\n\nPhòng thủ: Loại hàng rác ra khỏi hàng chờ bằng cách thực hiện các kiểu xóa đặc biệt sau khi đối thủ gửi hàng rác.\n\nPhản công: Gửi hàng rác lại sau khi xử xong toàn bộ hàng rác trong hàng chờ.\n\nTrong hầu hết các game, tấn công và phòng thủ là tương đương nhau: một đòn tấn công sẽ chặn một cú rác tới.","link":"","id":"4cedd7492500d476f10f4edcb5292c3cb3eaf4b2"},{"title":"Combo","tags":["nhom05g","ren","combo"],"category":"term","content":"Xóa nhiều hàng liên tiếp để tạo ra combo. Từ lần xóa hàng thứ 2 thì tính là 1 Combo, và từ lần xóa hàng thứ 3 thì tính là 2 Combo, và cứ như thế.\\nKhông như Back to Back, đặt một viên gạch = phá combo.\\n\\nỞ cộng đồng xếp gạch Nhật, combo được gọi là \\\"REN\\\", từ chữ kanji tiếng Nhật <連> (れん, ren).","link":"","id":"1af2c3293f69dc5673e1f079856188c34b1febc0"},{"title":"Spike","tags":["nhom05g","spike"],"category":"term","content":"Làm nhiều đợt tấn công liên tiếp trong một khoảng thời gian ngắn.\\n\\nCả Techmino và TETR.IO đều có bộ đếm spike, sẽ hiện bao nhiêu hàng rác bạn đã gửi cho đối thủ trong lúc spike.\\n\\nLưu ý: hàng rác mà bị tích lũy do mạng lag thì không được tính là spike.","link":"","id":"4ed130cdc0f445ce290a3a96aec3df6f7b881fc9"},{"title":"'Debt'","tags":["nhom05g","debt","owe"],"category":"term","content":"Một thuật ngữ hay được sử dụng trong cộng đồng Tetris Trung Quốc.\\n\\n\\\"Debt\\\" đề cập đến tình huống mà bạn chỉ có thể tấn công KHI và CHỈ KHI setup được hoàn thành. Nên, khi đang làm một hoặc nhiều debt liên tiếp, người chơi bắt buộc phải để ý tới đối thủ để đảm bảo an toàn; còn không, người chơi đó có thể bị bón hành sấp mặt.\\n\\nThuật ngữ này hay được sử dụng để diễn tả một số setup như TST tower.","link":"","id":"13de7c7a4e5f04a7541d71f120908e7c1febf65a"},{"title":"Passthrough","tags":["nhom05g","pingthrough"],"category":"term","content":"Chỉ tình huống cả hai người chơi cùng gửi tấn công lẫn nhau, nhưng thay vì chúng hủy bỏ lẫn nhau thì nó lại gửi thẳng vào bảng của đối phương.\\n\\nMột thuật ngữ khác là \\\"pingthrough\\\" đề cập tình huống passthrough xảy ra do ping cao.","link":"","id":"07e9017e1ddfeb5aa57b3be59da1f075d8a1fd87"},{"title":"Timing","tags":["nhom05g"],"category":"term","content":"Timimg đề cập đến việc lựa chọn khoảnh khắc để tấn công với nỗ lực tối ưu. Chọn đúng thời điểm cho phép bạn có thể phòng thủ trong khi đè bẹp đối thủ của bạn. Tuy nhiên, chúng tôi đề nghị những người chơi mới tập trung vào bảng và cải thiện tốc độ trước khi tập trung vào timing.","link":"","id":"8ba2a8161299eba258be813d9ca3cc7075aa5e00"},{"title":">H|Mis-action","tags":["nhom05h","misaction","misdrop","mishold"],"category":"","content":"Misdrop: Vô tình thả rơi / đặt gạch vào nơi không mong muốn.\\nMishold: Vô tình nhấn nhầm phím Hold. Việc này có thể dẫn đến việc dùng một viên gạch không mong muốn.\\n\\nCả misdrop và mishold có thể làm bạn mất cơ hội để làm PC.","link":"","id":"0deb13bbb55611f12d7821d184f5a9726fa8125d"},{"title":">I|Spin","tags":["nhom05i"],"category":"","content":"(Ở nhiều game, đa số các game cổ điển không có cái này)\\n\\nXoay gạch để di chuyển tới một vị trí mà bình thường sẽ không tiếp cận được. Ở một số game, thao tác này sẽ gửi thêm hàng rác hoặc là tăng thêm điểm. Mỗi game sẽ có cách kiểm tra Spin khác nhau.","link":"","id":"d37af6f5f50cbe1bd975f42ea6c6bf4553adeaf8"},{"title":"Mini","tags":["nhom05i"],"category":"term","content":"Một kiểu spin (được cho là) dễ làm hơn so với spin thông thường (vì trong một số game cũ, chúng được gọi là \\\"Ez T-spin\\\").\\nLượng điểm bổ sung và hàng rác đều ít hơn so với spin thông thường.\\n\\nMỗi game sẽ có các quy tắc khác nhau để kiểm tra và chúng có thể không trực quan.\\nNhưng bạn chỉ cần nhớ mấy cách làm Mini-spin là được!","link":"","id":"bdd0722b84b9d8c57f332f012ad2d621b0e44c21"},{"title":"All-spin","tags":["nhom05i","allspin"],"category":"term","content":"Một quy luật mà trong đó, làm Spin bằng gạch gì đều cũng được thưởng thêm điểm và gửi thêm hàng rác; trái ngược với\\\"T-spin Only\\\" (Chỉ làm T-spin).","link":"","id":"ca45fa29c0615e75752420601d317be054239b72"},{"title":"T-spin","tags":["nhom05i","tspin"],"category":"term","content":"Spin được thực hiện bởi Tetromino T.\\n\\nT-spin chủ yếu được phát hiện bởi \\\"quy luật 3 góc\\\": nếu 3 trong 4 góc của hình vuông ngoại tiếp gạch T bị đè bởi bất kỳ gạch nào, thì spin đó được tính là T-spin.\\n\\nNgoài quy tắc đó ra thì còn có một số quy tắc để phát hiện T-spin và phân biệt giữa T-spin và Mini T-spin.","link":"","id":"ea7bf814496cc0790ac9a00d1238437e1718b5e9"},{"title":"O-Spin","tags":["nhom05i","ospin"],"category":"term","content":"Gạch O vốn dĩ \\\"tròn\\\", không đổi hình dạng khi xoay ở bất cứ hướng nào, nên nó không thể \\\"đá\\\" được. Do đó gạch O không tài nào leo ra khỏi \\\"lỗ\\\" hoặc \\\"hố\\\" nếu bị kẹt. Lợi dụng việc này, có người đã làm video fake cách làm O-spin trong Tetris 99 và Tetris Friends\\n\\nHiện tại có 2 hệ thống xoay hỗ trợ O-spin:\\n\\tXRS cho phép gạch O có thể \\\"teleport\\\" tới một cái lỗ.\\n\\tTRS cho phép gạch O \\\"teleport\\\" và \\\"biến hình\\","link":"","id":"bff61afbab98bef5978768bf23cb20dd37cf360b"},{"title":"Fin, Neo, Iso","tags":["nhom05i","fin","neo","iso"],"category":"pattern","content":"Tên của 3 kiểu T-spin sử dụng wall-kick table đặc biệt của gạch T. Chúng không được sử dụng nhiều trong game bởi vì độ phức tạp và thường hay bị nerf bởi đa số game.","link":"","id":"6d8823307e0e9d5b79e054b7f2571d460135ff17"},{"title":"Freestyle","tags":["nhom05i"],"category":"term","content":"Thuật ngữ hay được nhắc nhiều trong thử thách 20TSD. Freestyle là kiểu chơi không dùng setup nào để hoàn thành một số lượng TSD nhất định nào đó.\\n\\nFreestyle khó hơn nhiều so với việc sử dụng setup nào đó như LST\\nNhững màn chạy dùng Freestyle có thể phản ánh cho các kỹ năng T-spin của người chơi trong các trận đấu trong thế giới thực.","link":"","id":"8c56d1d9d5dacf3f1a0bb8e834b51555aca0c925"},{"title":">J|K.th. xóa hàng","tags":["nhom05j"],"category":"","content":"NHÓM 5J: KỸ THUẬT XÓA HÀNG","link":"","id":"a31bb6e829ad7533f347ba9875ba8990c58940e9"},{"title":"Xóa 1 / 2 / 3 hàng","tags":["nhom05j","1","2","3","single","double","triple"],"category":"term","content":"Single: Xóa 1 hàng cùng một lúc.\\nDouble: Xóa 2 hàng cùng lúc.\\nTriple: Xóa 3 hàng cùng lúc.","link":"","id":"f87a29c3e2fa962369dc371b90a912ccb9213c74"},{"title":"Techrash","tags":["nhom05j","tetris","4"],"category":"term","content":"*Chỉ có trên Techmino*\\nXóa 4 hàng cùng một lúc.","link":"","id":"581aeb9553b5fc2814749554149b50c01272be9e"},{"title":"Tetris","tags":["nhom05j","4"],"category":"term","content":"Đây chính là tên của một tựa game (và cũng là tên thương hiệu của nó). Đây cũng là thuật ngữ chỉ việc xóa 4 hàng cùng lúc trong các game chính thức.\\n\\nĐược ghép từ 2 từ: Tetra (<τέτταρες>, \\\"téttares\\\", có nghĩa là số 4 trong tiếng Hy Lạp) and tennis (quần vợt, môn thể thao yêu thích nhất của người đã sáng tạo ra Tetris).\\n\\nNhắc nhẹ: những game xếp gạch được phát triển bởi Nintendo và SEGA đều được cấp phép bởi TTC. Hai công ty này không (hề) sở hữu bản quyền của Tetris","link":"","id":"af48fe99d409bfda2f0dbe896f2fc6a16adb68c6"},{"title":"TSS, TSD, TST","tags":["nhom05j","t1","tspinsingle","T-spin","Đơn","t2","tspindouble","T-spn","Đôi","t3","tspintriple","T-spin","Tam"],"category":"term","content":"T-spin Single (TSS) | T-spin Đơn\\n\\tXóa một hàng bằng T-spin.\\n\\nT-spin Double (TSD) | T-spin Đôi\\n\\tXóa hai hàng bằng T-spin.\\n\\nT-spin Triple (TST) | T-spin Tam\\n\\tXóa ba hàng bằng T-spin.","link":"","id":"f97799aaa0bda464faa21db9bfe63ab715384531"},{"title":"MTSS","tags":["nhom05j","mintspinsingle","tsms","tspinminisingle","Mini","T-spin","Đơn"],"category":"term","content":"Mini T-spin Single | Mini T-spin Đơn\\nTừng biết tới với cái tên \\\"T-spin Mini Single\\\" (TSMS) (T-spin Mini Đơn).\\n\\nXóa một hàng bằng Mini T-spin.\\n\\nMỗi game sẽ có cách khác nhau để xác định xem T-spin đó có phải là Mini hay không.","link":"","id":"d2ea085bad3bf2489b164352415d424a8718af95"},{"title":"MTSD","tags":["nhom05j","minitspindouble","tsmd","tspinminidouble","Mini","T-spin","Đôi"],"category":"term","content":"Mini T-spin Double | Mini T-spin Đôi\\nTừng biết tới với cái tên \\\"T-spin Mini Double\\\" (TSMD) (T-spin Mini Đôi).\\n\\nXóa hai hàng bằng Mini T-spin.\\n\\nMTSD chỉ xuất hiện hạn chế trong một vài game và có các cách kích hoạt khác nhau.","link":"","id":"e806ee88f6612ecebac7aa815e8261d2ff1374e3"},{"title":"Back to Back","tags":["nhom05j","b2b","btb","backtoback"],"category":"term","content":"Hay còn gọi là B2B. Xóa 2 hoặc nhiều lần xóa theo kiểu nâng cao (như Tetris hay Spin) liên tiếp (nhưng không được xóa kiểu bình thường giữa chừng).\\nKhông như combo, Back To Back sẽ không bị mất khi đặt gạch.\\n\\nỞ Techmino, B2B được tính bằng thanh năng lượng, chứ không tính theo số lần xóa kiểu đặc biệt.\\nCũng trong Techmino, nhiều B2B liên tiếp được tính là Back-to-back-to-back (B3B) (xem mục B2B2B để biết thêm).\\n\\nTechmino cũng tính cả PC và HPC liên tiếp là B2B và B3B","link":"","id":"ffe61f74404c4fe3984daa561d8ea1b4425d399b"},{"title":"B2B2B","tags":["nhom05j","b3b","backtobacktoback"],"category":"term","content":"*Chỉ có trên Techmino*\\n\\nBack to back to back, hay còn gọi là B3B (hoặc B2B2B). Thực hiện nhiều Back to Back liên tiếp để lấp đầy thanh B3B; cuối cùng khi bạn đã lấp B3B vượt một mức nhất định, bạn có thể tấn công mạnh hơn khi làm được B2B, nhờ sức mạnh từ B3B","link":"","id":"b4c31186c57bd9bca81ee6386b6ddb2ded6c4259"},{"title":"All Clear","tags":["nhom05j","pc","perfectclear","ac","allclear"],"category":"term","content":"Còn được biết tới là Perfect Clear (PC). Đây là thuật ngữ được dùng nhiều trong cộng đồng và cũng như được dùng trong Techmino\\nXóa toàn bộ gạch ra khỏi bảng, không trừ gạch nào\\n\\n[Sea: còn có một từ cổ cho thuật ngữ này nữa, đó là \\\"Bravo\\\"]","link":"","id":"9dcaacad7b8c060c094860d675d191937622a6a6"},{"title":"HPC","tags":["nhom05j","hc","halfperfectclear"],"category":"term","content":"*Chỉ có trên Techmino*\\nHalf Perfect Clear\\n\\nMột biến thể của All Clear. Nếu hàng đó bị xóa mà rõ ràng giống với Perfect Clear khi bỏ qua những hàng bên dưới, thì được tính là Half Perfect Clear và sẽ gửi thêm một lượng hàng rác nhỏ","link":"","id":"6436f4a12ea6f7a5a3d1a86816b625d6816b3a4a"},{"title":">K|T.ngữ khác","tags":["nhom05k"],"category":"","content":"NHÓM 5L: CÁC THUẬT NGỮ KHÁC","link":"","id":"c6ebc456edf87c3eef11bb697af2235b04794fba"},{"title":"sub","tags":["nhom05k","sub"],"category":"term","content":"Sub-[số] có nghĩa là khoảng thời gian ở dưới một mốc nhất định. Đơn vị thời gian thường được bỏ qua và có thể tự suy ra.\\n\\nVí dụ: \\\"sub-30\\\" có nghĩa là hoàn thành chế độ 40 hàng dưới 30 giây, \\\"sub-15\\\" có nghĩa là hoàn thành chế độ 1000 hàng dưới 15 phút.\\n\\n\\\"Sub\\\" thường được sử dụng với số đã được làm tròn (cho nên hiếm khi người ta sử dụng theo kiểu \\\"sub-62\\\")","link":"","id":"46d2b76f28ca62cfaa8bba74d6df88b60120b964"},{"title":"‘Researching’","tags":["nhom05k","scientificresearching"],"category":"term","content":"(<科研>, ké yán)\\n\\nMột thuật ngữ đôi khi được dùng ở cộng đồng Tetris Trung Quốc, chỉ việc nghiên cứu / luyện tập kỹ thuật nào đó (ví dụ như một setup T-spin mới) trong môi trường chơi đơn và tốc độ rơi thấp…\\nTrong Techmino, thuật ngữ này chỉ những mode đòi hỏi bạn gần như phải dùng spin trong suốt màn chạy.","link":"","id":"af194c3cb1fb90736f9b1970207bd3e1c74c6772"},{"title":"Bone block","tags":["nhom05k","bone","tgm"],"category":"term","content":"Đây là skin được dùng trong những phiên bản đời đầu của Tetris\n\nTrước đây, tất cả máy tính đều sử dụng Giao diện Dòng lệnh (Command-Line Interfaces), cho nên mỗi ô gạch đều được hiển thị dưới dạng 2 ngoặc vuông (như thế này:`CHAR.icon.bone`).\nTrông nó nhìn rất giống cục xương, nên đôi khi được gọi là skin bone block (gạch xương).\n\nTrong Techmino, bone block được mô tả là \"một skin gạch duy nhất, lạ mắt mà tất cả các gạch đều sử dụng\".\nSkin khác nhau sẽ có skin bone block khác nhau.\n\nCũng trong Techmino (khi để ngôn ngữ là tiếng Việt), từ \"gạch`CHAR.icon.boneđược dùng để chỉ bone block.","link":"","id":"fd209b63541b02e7187fa05d6d5cc7ca425487df"},{"title":"=[NHÓM 06]=","tags":["nhom06"],"category":"","content":"NHÓM 06: CÁC GAME XẾP GẠCH\n\nNội dung sau đây là những giới thiệu ngắn gọn về một số game xếp gạch chính thức và do fan làm có mức độ phổ biến cao. MrZ - tác giả của Techmino đã để lại một vài lời nhận xét, được đánh dấu chủ yếu bằng hai dấu ngoặc vuông\n\nSquishy cũng có một số lời nhận xét và thông tin bổ sung, lời này được đánh dấu bắt đầu bằng \"Sea\" và ở trong một cặp ngoặc vuông\n\nHãy nhớ là không phải game nào được nói đến đều có lời nhận xét, chúng chỉ là những ý kiến chủ quan và không có tính chuyên môn, và cũng không nhất thiết phản ánh chất lượng của game. Chỉ đọc / dùng để tham khảo.","link":"","id":"ebd654757378d083ae111a40154032f542487fff"},{"title":"King of Stackers","tags":["nhom06","kos","kingofstackers"],"category":"game","content":"Chơi trên trình duyệt | Chơi trực tuyến | Hỗ trợ màn hình cảm ứng\n\nGọi tắt là KoS. Một game xếp gạch chơi trên trình duyệt theo lượt. Về cơ bản: người chơi sẽ thay phiên nhau đặt các gạch trong bảng của họ theo chu kỳ 7 gạch. Hàng rác chỉ có thể vào bảng khi một gạch được đặt mà không xóa một hàng nào. Trò chơi mang tính chiến lược cao và có các tùy chọn khác nhau cho cơ chế tấn công.","link":"https://kingofstackers.com/games.php","id":"19baf92beb3a1253849a11399525c12fd74d925c"},{"title":"Tetr.js","tags":["nhom06","tetrjs","tetr.js"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn | Hỗ trợ màn hình cảm ứng\n\nMột game xếp gạch chơi trên trình duyệt với nhiều điều chỉnh và chế độ chuyên nghiệp.\nLiên kết của mục này sẽ đưa bạn tới bản của Farter (bản này là một bản đã mod, đã thêm một vài chế độ khác)\nBạn cũng có thể tìm một phiên bản khác có tên là \"Tetr.js Enhanced\" - bản mod này do Dr Ocelot làm (đã bị gỡ xuống và thay thế bằng Tetra Legends, nhưng cũng bị dừng phát triển hoàn toàn từ T12 / 2020)\n\n[MrZ: Giao diện đơn giản với hầu như không có bất kỳ animation nào.\nChỉ có một số tổ hợp phím ảo khả dụng cho thiết bị di động.]","link":"http://farter.cn/t","id":"100c280face148b5188dfd0cb4cd211f0bb9fc0f"},{"title":"Tetra Legends","tags":["nhom06","tl","tetralegends"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn\n\nGọi tắt là TL. Một tựa game chứa nhiều chế độ chơi đơn + 2 chế độ nhịp điệu. Nó cũng hình dung các cơ chế thường ẩn trong các trò chơi Tetris khác. Quá trình phát triển đã dừng lại hoàn toàn từ T12 / 2020.","link":"https://tetralegends.app","id":"5d060afe77884aec40364108d41584dd5cce7607"},{"title":"Ascension","tags":["nhom06","asc"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là ASC. Game sử dụng hệ thống xoay có tên là ASC và có nhiều chế độ chơi đơn. Chế độ 1 đấu 1 hiện vẫn còn trong giai đoạn Alpha (tính tới 16 / T4 / 2022).\nChế độ Stack của Techmino cũng bắt nguồn từ game này.","link":"https://asc.winternebs.com","id":"645c8ce080e0c65dd2490cf4577d0a01af0707e6"},{"title":"Jstris","tags":["nhom06","js"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn / Chơi trực tuyến | Hỗ trợ cảm ứng\n\nGọi tắt là JS. Game này có một số chế độ chơi đơn với thông số có thể điều chỉnh được. Có thể điều chỉnh phím ảo trên màn hình, nhưng trò chơi này không có hiệu ứng động nào cả.","link":"https://jstris.jezevec10.com","id":"e5af3dd8a2d2dc8ff097616d88c6c7cff46e7887"},{"title":"TETR.IO","tags":["nhom06","io","tetrio"],"category":"game","content":"Chơi trên trình duyệt / client chính thức | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là tetrio hoặc IO. Trò chơi này có một hệ thống xếp rank cũng như có chế độ tự do với nhiều thông số có thể tùy chỉnh. Trò chơi này cũng có một client dành cho máy tính, giúp cải thiện tốc độ, giảm độ trễ và bỏ quảng cáo\n\n[MrZ: Có vẻ như Safari không thể mở game này.]","link":"https://tetr.io","id":"d8c866cbfb2debeaff1f5472597b0b60e443e04f"},{"title":"Nuketris","tags":["nhom06"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn / Chơi trực tuyến\n\nMột trò xếp gạch có chế độ 1 đấu 1 có xếp rank + các chế độ chơi đơn thông thường","link":"https://nuketris.com","id":"7a674d46b1235e2f56bc3b676c0007758490004a"},{"title":"Worldwide Combos","tags":["nhom06","wwc","worldwidecombos"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là WWC. Có chế độ 1 đấu 1 toàn cầu: chơi với người thật hoặc chơi với replay; có vài quy tắc khác nhau, với các trận đấu gửi rác bằng bom.","link":"https://worldwidecombos.com","id":"95a6b080ebfb1d455a0b454ef554d6d3d4142da0"},{"title":"Tetris Friends","tags":["nhom06","tetris","friends","tf","tetrisfriends","notrisfoes"],"category":"game","content":"Chơi trên trình duyệt / client chính thức | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là TF. Một game xếp gạch dùng engine là một plugin đã nghỉ hưu từ năm 2021 (vì vấn đề bảo mật). Từng rất phổ biến trong quá khứ, nhưng tất cả máy chủ chính thức đã đóng cửa từ mấy năm trước. Hiện giờ vẫn còn một máy chủ riêng tên là \"Notris Foes\". Nhấn vào nút hình địa cầu để mở ở trong trình duyệt","link":"https://notrisfoes.com","id":"9674c9c443946b9bde5efe0769883c100624e6fb"},{"title":"tetris.com [1 / 2]","tags":["nhom06","tetris","tetris.com","online","official"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn | Hỗ trợ màn hình cảm ứng\n\nGame Tetris chính thức từ tetris.com, mà chỉ có một chế độ (Marathon). Bù lại, có hỗ trợ hệ thống điều khiển thông minh bằng chuột","link":"","id":"b361d86a01eaf1ccd5d8805832f90e02b88c9d6a"},{"title":"tetris.com [2 / 2]","tags":["nhom06","tetris","tetris.com","online","official"],"category":"game","content":"[Mục này được viết bởi Squishy, chỉ xuất hiện ở bản dịch Zictionary này\nCó thể áp dụng cho \"Tetris Gems\" và \"Tetris Mind Bender\"]\n\nHiện có ba cách điều khiển: hai cách dành cho màn hình cảm ứng gồm \"vuốt\" (swipe) và \"thông minh\" (smart), hoặc cắm bàn phím (nếu máy hỗ trợ).\nBạn có thể thử nghiệm với cả ba chế độ điều khiển để tìm xem chế độ nào tối ưu với mình nhất\n\nĐể điều khiển bằng bàn phím thì hãy kết nối bàn phím (miễn là điện thoại nhận được bàn phím thì game cũng sẽ nhận)\nĐể đổi giữa \"vuốt\" và \"thông minh\" thì hãy mở Options của game.","link":"","id":"8e12dab0ac3f4a822ac31aacc93c1b9639dbfa9d"},{"title":"Tetris Gems","tags":["nhom06","tetris","online","official","gem"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn | Hỗ trợ màn hình cảm ứng\n\nMột game xếp gạch khác từ tetris.com\nCó cơ chế trọng lực và mỗi ván chỉ kéo dài trong 1 phút. Có 3 loại gem (ngọc) khác nhau với chức năng khác nhau.","link":"","id":"f04b61008fdb169cccc8c960e62e18a74956fc8e"},{"title":"Tetris Mind Bender","tags":["nhom06","tetris","online","official","gem"],"category":"game","content":"Chơi trên trình duyệt | Chơi đơn | Hỗ trợ màn hình cảm ứng\n\nMột game xếp gạch khác từ tetris.com\nMột chế độ Marathon vô tận với một mino đặc biệt gọi là \"Mind Bender\" sẽ đưa cho bạn ngẫu nhiên một hiệu ứng nào đó (có thể là tốt hoặc xấu).","link":"","id":"a371b0bc3c48927f6285ab002cb9e28589d55d68"},{"title":"Techmino","tags":["nhom06"],"category":"game","content":"Đa nền tảng | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là Tech. Một tựa game xếp gạch được phát triển bởi MrZ (và các thành viên khác trong 26F-Studio). Sử dụng engine LÖVE (love2d). Có rất nhiều chế độ chơi đơn, cũng như có nhiều thông số có thể tùy chỉnh được. Tuy nhiên, chế độ nhiều người chơi hiện tại vẫn đang còn phát triển","link":"","id":"b44e3a61aa39ed9df6e925b53619af0607a10dc8"},{"title":"Falling Lightblocks","tags":["nhom06","fl","fallinglightblocks"],"category":"game","content":"Chơi trên trình duyệt / iOS / Android | Chơi đơn / Chơi trực tuyến\n\nMột game xếp gạch đa nền tảng có thể chơi ở chế độ dọc hoặc ngang. Game này có DAS và ARE khi xóa hàng cố định; và có thể điều chỉnh cơ chế điều khiển trên điện thoại. Hầu hết các chế độ trong game đều được thiết kế dựa trên NES Tetris, nhưng cũng có vài chế độ hiện đại. Chế độ Battle theo kiểu nửa \"theo lượt\", nửa \"theo thời gian thực\", rác cũng không vào hàng chờ hay có thể hủy được.","link":"https://golfgl.de/lightblocks/","id":"f96c5c55878a10f42c552895d49188f2ed2b1ee5"},{"title":"Cambridge","tags":["nhom06"],"category":"game","content":"Đa nền tảng | Chơi đơn\n\nMột game xếp gạch được phát triển bằng LÖVE, với mục tiêu là tạo ra một nền tảng mạnh mẽ, dễ dàng tùy chỉnh để tạo ra các chế độ mới. Ban đầu được phát triển bởi Joe Zeng, Milla đã tiếp quản quá trình phát triển từ 08 / T10 / 2020, kể từ V0.1.5.\n\n- Tetris Wiki","link":"","id":"ca392dd55a88731012949a3f750b3bf0f0508952"},{"title":"Nanamino","tags":["nhom06"],"category":"game","content":"Windows / Android | Chơi đơn\n\nMột trò chơi do fan làm đang được phát triển với hệ thống xoay đặc trưng cực kỳ thú vị,","link":"","id":"31c53278114d64d8e3ac92b7453c23fabd46e03a"},{"title":"TGM","tags":["nhom06","tetrisgrandmaster","tetristhegrandmaster"],"category":"game","content":"Máy thùng, và các hệ máy khác* | Chơi đơn / Chơi hai người\n\nTetris: The Grand Master, một series Tetris dành cho máy thùng, nổi tiếng với độ khó cực cao - được xem là series game khó nhất (tại thời điểm ra mắt). Những thứ như S13 hay GM cũng từ chính series này. TGM3 được coi là tựa game nổi tiếng nhất của series này.\n\n(*): Hiện TGM1 và TGM2 đã được port sang PS và Switch dưới gói Arcade Archives.","link":"","id":"bafc4c3bbcc01230d5aae01c5016c4890d8a1521"},{"title":"DTET","tags":["nhom06"],"category":"game","content":"Windows | Chơi đơn\n\nMột game xếp gạch dựa trên quy tắc Cổ điển của TGM + 20G với hệ thống xoay gạch mạnh mẽ. Cơ chế điều khiển tốt nhưng không có tùy chỉnh nào ngoài việc có thể gán lại phím.\n\nGame này bây giờ hơi khó tìm và bạn có thể phải cài tệp DLL cần thiết bằng tay. Tuy nhiên cũng may là có một bài hướng dẫn cách cài DTET, bạn có thể nhấn nút hình địa cầu để mở bài viết.\n\nCẢNH BÁO: Hãy cẩn thận khi tải bất cứ thứ gì về, kể cả file DLL hay EXE!","link":"https://t-sp.in/dtet","id":"5d2322c6a4822a4d27b2663e9d42ce560eacfeb9"},{"title":"Heboris","tags":["nhom06","hb"],"category":"game","content":"Windows | Chơi đơn\n\nMột game với phong cách chơi máy thùng, có khả năng mô phỏng nhiều chế độ của các trò chơi Tetris khác.","link":"","id":"b6290881755b84e35aab37a5164c2d4526a9059a"},{"title":"Texmaster","tags":["nhom06","txm"],"category":"game","content":"Windows | Chơi đơn\n\nMột game có tất cả chế độ trong TGM để có thể sử dụng để luyện chơi TGM. Cần lưu ý rằng World Rule trong Texmaster sẽ hơi khác một chút so với TGM, ví dụ như game sử dụng cơ chế \"Thả nhẹ-khóa tức thì\"* thay vì sử dụng cơ chế \"Thả nhẹ\" thông thường và bảng kick cũng có đôi chút khác biệt\n\n(*): Bản Zictionary tiếng Anh ghi là \"instant-lock soft drop(s)\". Có thể hiểu là bạn giữ nút Thả nhẹ, gạch vừa chạm đất là chốt vị trí đó luôn - giống với các game xếp gạch cổ điển.","link":"","id":"31a272f537e0d89aadc01668963ab362d8132210"},{"title":"Tetris Effect","tags":["nhom06","tec","tetriseffectconnected"],"category":"game","content":"PS / Oculus Quest / Xbox / NS / Windows | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là TE(C). Một game xếp gạch chính thức với đồ họa và nhạc nền lạ mắt chuyển động theo điều khiển của bạn. Phiên bản cơ bản (Tetris Effect) chỉ có các chế độ chơi đơn. Phiên bản mở rộng, Tetris Effected Connected có 4 chế độ chơi trực tuyến đó là: Connected (VS), Zone Battle, Score Attack, và Classic Score Attack.","link":"","id":"4b4a75bcba16682ed2a265aacfebcec142481a1d"},{"title":"Tetris 99","tags":["nhom06","t99","tetris99"],"category":"game","content":"Nintendo Switch | Chơi đơn / Chơi trực tuyến\n\nMột trò chơi nổi tiếng với chế độ Battle Royale 99 người và có nhiều chiến lược thú vị mà không có trong các game chiến đấu truyền thống. Nó cũng có các chế độ chơi đơn hạn chế như Marathon hay các trận đấu bot có sẵn dưới dạng DLC.","link":"","id":"2b34a25506deb4be8f3b45bd9f8541d2d6855ab1"},{"title":"Puyo Puyo Tetris","tags":["nhom06","ppt","puyopuyotetris"],"category":"game","content":"PS / NS / Xbox / Windows | Chơi đơn / Chơi trực tuyến\n\nĐây là một game được ghép từ hai trò chơi giải đố: Tetris và Puyo Puyo, và bạn có thể chơi đối đầu trong cả hai game này. Có nhiều chế độ chơi đơn và chơi trực tuyến.\n\n[MrZ: Bản PC (Steam) có cơ chế điều khiển và trải nghiệm trực tuyến khá là tệ.]","link":"","id":"838b46138bf233c7c473e5e2ba4a3bd132987091"},{"title":"Tetris Online","tags":["nhom06","top","tetrisonline"],"category":"game","content":"Windows | Chơi đơn / Chơi trực tuyến\n\nMột game xếp gạch của Nhật Bản đã nghỉ hưu từ lâu. Có chế độ chơi đơn và chơi trực tuyến. Có thể điều chỉnh DAS và ARR (nhưng không thể đặt thành 0). Độ trễ đầu vào nhỏ. Tuy server chính ở Nhật đã bị đóng cửa còn lâu nhưng vẫn còn tồn tại server riêng. Game rất phù hợp cho những người mới bắt đầu.","link":"","id":"16b111f52a3fbffdccb79672d1922ba24ecbe789"},{"title":"Tetra Online","tags":["nhom06","TO","tetraonline"],"category":"game","content":"Windows / macOS / Linux | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là TO. Một tựa game xếp gạch được phát triển bởi Dr Ocelot và Mine. Các loại độ trễ như AREs được cố tình đẩy ở giá trị cao, và những ai đã từng quen chơi xếp gạch mà có độ trễ thấp / không có độ trễ sẽ khó làm quen với game này\nGame đã bị gỡ khỏi Steam vào ngày 9 / T12 / 2020 do TTC gửi thông báo DMCA\nDù sao thì, vẫn còn một bản build có thể tải từ GitHub.","link":"https://github.com/Juan-Cartes/Tetra-Offline/releases/tag/1.0","id":"20c4307f43674f184deaf184e40a8abd2b338c80"},{"title":"Cultris II","tags":["nhom06","c2","cultris2","cultrisii"],"category":"game","content":"Windows / OS X | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là C2. Được thiết kế dựa trên Tetris cổ điển, Cultris II cho phép bạn có thể điều chỉnh DAS và ARR. Chế độ chiến đấu tập trung vào các combo dựa trên thời gian, thử thách người chơi về mặt tốc độ, n-wide setup và kỹ năng đào xuống của người chơi\n\n[MrZ: Phiên bản dành cho Mac đã không được bảo trì trong thời gian dài. Nếu bạn đang dùng macOS 10.15 Catalina hoặc macOS mới hơn thì không thể chạy game này.]","link":"","id":"43e31cf6e3abe2f925529b8089e30936d816df20"},{"title":"Nullpomino","tags":["nhom06","np"],"category":"game","content":"Windows / macOS / Linux | Chơi đơn / Chơi trực tuyến\n\nGọi tắt là NP. Một game xếp gạch chuyên nghiệp có khả năng tùy biến cao. Gần như mọi thông số trong game đều có thể điều chỉnh được.\n\n[MrZ: Giao diện của game mang phong cách retro. Ngoài ra, game chỉ có thể điều khiển thông qua bàn phím, nên một vài người chơi mới sẽ gặp khó khi làm quen. Ngoài ra, có vẻ như macOS Monterey không thể chạy được game này.]","link":"","id":"a6bd81b830adca16a2fb72424daab53ccccbf133"},{"title":"Misamino","tags":["nhom06"],"category":"game","content":"Windows | Chơi đơn\n\nChỉ có chế độ chơi 1 đấu 1 với bot, chủ yếu là chơi theo lượt. Bạn có thể viết bot cho game này (nhưng bạn cần phải học API của nó).\n\nMisamino cũng là tên của bot trong game này.","link":"","id":"efe566afed212c13d3de24c098dee6e89cb1f6aa"},{"title":"Touhoumino","tags":["nhom06"],"category":"game","content":"Windows | Chơi đơn\n\nMột game Tetris do fan làm. Game này là một bản chỉnh sửa của Nullpomino với các yếu tố được thêm vào từ Touhou Project.\n\nChế độ Marathon có chứa \"Spell Cards\" của Touhou Project (thêm hiệu ứng đặc biệt để quấy phá màn chơi), chỉ có thể phá bằng cách đạt được số điểm  yêu cầu trong thời gian có hạn.\n\n[MrZ: Chỉ nên chơi nếu bạn đã có kỹ năng ở mức nào đó*, nếu không, bạn thậm chí không biết mình đã chết như thế nào.]\n\n(*) Bản Zictionary tiếng Anh ghi là: \"half-decent skills\", dịch sát nghĩa là \"một nửa kỹ năng","link":"","id":"7039bedf46f079bdb657aa357cc1d8fde7b8fd9b"},{"title":"Tetris Blitz","tags":["nhom06","blitz","ea","mobile","phone"],"category":"game","content":"iOS / Android | Chơi đơn\n\nMột game xếp gạch được làm bởi Electronic Arts (EA). Có cơ chế trọng lực, và mỗi ván game chỉ kéo dài trong vòng 2 phút. Game sẽ tạo một cái giếng cao khoảng 10 hàng ở đầu game (và ngay sau khi bạn làm được Perfect Clear). Game có chế độ \"Frenzy\" có thể kích hoạt bằng cách liên tục xóa hàng; cùng với rất nhiều loại power-up khác nhau, có cả Finisher giúp cho màn chơi kết thúc của bạn thêm đẹp mắt và buff mạnh số điểm của bạn lên. Game không có cơ chế top-out mà thay vào đó game sẽ tự động xóa các hàng trên cùng nếu có gạch chồng lên gạch đã đặt.\n\nGame đã nghỉ hưu từ T04 / 2020","link":"","id":"ddc5e03e4fc2572464b2825517cfed62fa43a704"},{"title":"Tetris (EA)","tags":["nhom06","tetris","ea","galaxy","universe","cosmos","mobile","phone"],"category":"game","content":"iOS / Android | Chơi đơn / Chơi trực tuyến?\n\nMột tựa game xếp gạch được phát triển bởi EA. Có hai cách điều khiển: Swipe (Vuốt) và One-Touch (Một chạm). Game này có chế độ Galaxy cùng với chế độ Marathon (có cơ chế trọng lực), và mục tiêu của chế độ này là xóa hết tất cả các gạch của Galaxy trước khi hết chuỗi gạch\n\nRa mắt lần đầu năm 2011, nghỉ hưu từ T04 / 2020\n\n[Sea: game đang nhắc ở đây là bản năm 2011 (phát hành khoảng 2011 - 2012)]","link":"","id":"e7c4086aadf1f00040390d7d43d42f662e146924"},{"title":"Tetris (N3TWORK)","tags":["nhom06","tetris","n3twork","mobile","phone"],"category":"game","content":"iOS / Android | Chơi đơn\n\nMột tựa game xếp gạch, trước đây được phát triển bởi N3TWORK; PlayStudio đã tiếp quản quá trình phát triển từ cuối tháng 11 năm 2021. Có chế độ Chơi nhanh (Ultra nhưng 3 phút), Marathon, chế độ Royale 100 người chơi và chế độ Phiêu lưu (nơi mà bạn sẽ phải hoàn thành mục tiêu của màn chơi chỉ với số bước di chuyển có hạn).\n\nTừ cuối T11 / đầu T12 / 2022 và sau này, tất cả các tài khoản mới tạo chỉ có thể chơi chế độ Marathon và chế độ Phiêu lưu.\n\n[MrZ: UI thì tuyệt nhưng cơ chế điều khiển thì tệ]\n[Sea: Bạn tốt hơn đi kiếm game khác chứ game này bây giờ rác quá!]","link":"","id":"ed8eb0e1b78ccba218b6e48dfa35a04efbc76c34"},{"title":"Tetris Beat","tags":["nhom06","n3twork","rhythm"],"category":"game","content":"iOS | Chơi đơn\n\nMột game xếp gạch tới từ N3TWORK nhưng chỉ dành cho Apple Arcade. Ngoài chế độ Marathon cổ điển, game giới thiệu một chế độ được gọi là \"Beat\": người chơi sẽ phải thả gạch theo nhịp của BGM.\n\n[MrZ: Hiệu ứng của game rất là nặng và cơ chế điều khiển không được lý tưởng]","link":"","id":"897ef0e0202a8c670aaba9f2ef7a05aa634bf99a"},{"title":"Tetris Journey","tags":["nhom06","tetrisjourney","mobile","phone","huanyouji"],"category":"game","content":"iOS / Android | Chơi đơn\n\n(俄罗斯方块环游记)\n\nMột game xếp gạch đã nghỉ hưu từng được phát triển bởi Tencent dành cho Trung Quốc.\nCó 3 chế độ chơi trực tuyến, 4 chế độ chơi đơn cùng với một chế độ dựa trên cấp độ\nMỗi trận trong chế độ chơi trực tuyến dài 2 phút, nếu không ai bị top out thì ai gửi nhiều hàng nhất sẽ giành chiến thắng.\n\nCó thể điều chỉnh vị trí và kích thước phím ảo, nhưng không thể điều chỉnh DAS và ARR.\nGame đã nghỉ hưu từ 15 / T02 / 2023.","link":"","id":"b222e45b0007457830e0b316c7ea8673d8382ca8"},{"title":"JJ Tetris","tags":["nhom06","jjtetris"],"category":"game","content":"Android | Chơi trực tuyến\n\n(JJ块)\n\nMột game xếp gạch ở trên JJ Card Games (JJ棋牌). Chơi ở màn hình dọc, độ trễ đầu vào thấp, điều khiển mượt. DAS / ARR có thể điều chỉnh được và có thể đổi giữ Thả nhanh / Thả nhẹ, nhưng hạn chế về tùy biến bố cục phím ảo. Không HOLD cũng như B2B, không bộ đệm rác hay cơ chế hủy rác. Mỗi tấn công gửi tối đa 4 hàng, còn cơ chế combo thì \"ao chình\". Phần còn lại thì tương tự như Tetris hiện đại.","link":"","id":"285e83ff9265b82bcd335e7ac47901f45ff94b4b"},{"title":"Huopin Tetris","tags":["nhom06","huopin","qq"],"category":"game","content":"Windows | Chơi trực tuyến\n\n(火拼俄罗斯)\n\nMột game xếp gạch ở trên Tencent Game Center - một nền tảng chơi game trực tuyến dành riêng tại Trung Quốc. Có bảng rộng 12 ô, 1 NEXT, 0 HOLD, DAS và ARR giống với DAS và ARR hay dùng trong các app gõ văn bản. Chỉ có thể gửi rác bằng Tetris (gửi 3 hàng rác) và xóa 3 hàng (gửi 2 hàng rác). Hàng rác có cấu trúc xen kẽ và gần như không thể đào.","link":"","id":"ea31cc29cf88efc1cf5893fd89997d17dc27348e"},{"title":"=[NHÓM 07]=","tags":["nhom07"],"category":"","content":"NHÓM 07: MỘT VÀI CƠ CHẾ VÀ CHẾ ĐỘ CỦA MỘT SỐ GAME","link":"","id":"243cdca7b0a6bb1f99af6e9c1f109f6460f2f61d"},{"title":"Tàng hình một phần","tags":["nhom07","half","invisible","semi"],"category":"term","content":"Tên tiếng Anh: Semi-invisible\\nChỉ một quy tắc trong đó gạch sẽ tàng hình sau một khoảng thời gian từ lúc nó được đặt xuống.\\nKhoảng thời gian đó thường không được cố định, nên vẫn có thể mô tả nó là \\\"biến mất sau một vài giây\\\".","link":"","id":"2d035a9574e6023eb09b8f35c8c1cf3c452a4b8e"},{"title":"Tàng hình","tags":["nhom07","invisible"],"category":"term","content":"Tên tiếng Anh: Invisible\\nChỉ một quy tắc trong đó gạch sẽ tàng hình ngay lập tức sau khi đặt xuống\\n \\nNếu mode tàng hình hoàn toàn mà có hiệu ứng biến mất thì vẫn được chấp nhận. Tuy nhiên, nó làm game dễ hơn đôi chút\\n\\nỞ Techmino, chế độ tàng hình mà không có hiệu ứng biến mất được gọi là \\\"sudden invisible.\\","link":"","id":"9b746f2500936729ca9b2a4a9f50eebd690dedab"},{"title":"Chế độ MPH","tags":["nhom07","mph"],"category":"term","content":"Sự kết hợp của ba quy tắc:\\n\\n\\\"Memoryless - Không nhớ gì\\\" (chuỗi gạch tạo ra hoàn toàn ngẫu nhiên)\\n\\\"Previewless - Không biết trước gạch nào sẽ tới\\\" (không có hàng NEXT)\\n\\\"Holdless- Không có ô HOLD\\\".\\n\\nMột chế độ đòi hỏi tốc độ và phản ứng nhạy bén từ người chơi.","link":"","id":"d06870134d79e48146554b26cc577d0845dd200e"},{"title":"Secret Grade","tags":["nhom07","larger","than",">","<"],"category":"term","content":"Một easter egg trong series TGM.\\n\\nĐể có được \\\"secret grade\\\", người chơi sẽ làm một đường dích dắc (zigzag) (trông giống như \\\">\\\" hay \\\"<\\\") bằng cách tạo ra 1 ô trống duy nhất cho từng hàng. Mục tiêu cuối cùng là hoàn thành đường dích dắc cao (hơn) 19 hàng.\\n\\nNhấn vào nút hình địa cầu để xem các kỹ thuật dùng để đạt được Secret Grade.","link":"https://harddrop.com/wiki?search=Secret_Grade_Techniques","id":"c1ea852455df70659574fb0b5955f24e1f2430c7"},{"title":"Deepdrop (Rơi sâu)","tags":["nhom07"],"category":"term","content":"*Chỉ có trên Techmino*\\n\\nMột chức năng cho phép cho phép gạch có thể teleport xuyên đất để xuống phía dưới. Khi gạch đụng vào gạch đã đặt, nhấn phím Thả nhẹ để kích hoạt Deepdrop. Nếu có một cái lỗ phù hợp với hình dạng của gạch ở dưới vị trí gạch đang rơi, gạch sẽ được teleport vào lỗ đó.\\nCơ chế này đặc biệt hữu ích cho AI vì nó cho phép AI bỏ qua sự khác biệt giữa các hệ thống xoay khác nhau.","link":"","id":"9f09fb6bfecd43a3ed30d2e51a85854dcd90eea0"},{"title":"=[NHÓM 08]=","tags":["nhom08"],"category":"","content":"NHÓM 08: BOT","link":"","id":"a98d880dc385583a997c9619bd9eb65ad97da5e9"},{"title":"Cold Clear","tags":["nhom08","cc","coldclear","ai","bot"],"category":"term","content":"Một bot chơi Tetris. Được viết bởi MinusKelvin, ban đầu được viết cho Puyo Puyo Tetris.\\nBản Cold Clear ở trong Techmino có hỗ trợ All-spin và hệ thống TRS (nhưng không hỗ trợ O-spin).","link":"","id":"fe8bc5b17172626df7e12d9116c6e7bc4767165d"},{"title":"ZZZbot","tags":["nhom08","ai","bot","zzztoj"],"category":"term","content":"Một bot chơi xếp gạch. Được viết bởi một người chơi Tetris Trung Quốc có tên là 奏之章 (Zòu Zhī Zhāng) và hoạt động khá tốt trong nhiều game (sau khi điều chỉnh các thông số cần thiết).\\nBạn cũng có thể sử dụng bot này trên TETR.IO.","link":"","id":"2c6101494fda7d74bd4c1c0d764608d61b32f7be"},{"title":"=[NHÓM 09]=","tags":["nhom09"],"category":"","content":"NHÓM 09: WIKI; CÁC TRANG WEB BÀY SETUP, CUNG CẤP CÂU ĐỐ & CHIA SẺ SETUP","link":"","id":"6c8df0aecdb3e1a89dacf56d189d5c70e7e7eb5e"},{"title":">A|Wiki","tags":["nhom09a"],"category":"","content":"","link":"","id":"04b57c88eef668d6d8e85598b3f129e69e8d97bf"},{"title":"Wiki Hard Drop","tags":["nhom09a","harddrop","hd","wiki"],"category":"help","content":"Một wiki về Tetris được host bởi cộng đồng Hard Drop.","link":"https://harddrop.com/wiki/Tetris_Wiki","id":"e1b4dbcab8143995232d84f33db1b8ee46d9e69c"},{"title":"Tetris.wiki","tags":["nhom09a","tetris","wiki"],"category":"help","content":"Một wiki tập trung vào các nội dung liên quan đến Tetris. Wiki được tạo ra từ năm 2015 bởi Myndzi, hiện đang được quản lý bởi Simon.lc. Trong những năm qua, hàng nghìn đóng góp đã được thực hiện để ghi lại các game xếp gạch chính thức và các game do fan làm, các series, những cơ chế của game,… cũng như tạo ra những bài hướng dẫn để cải thiện trải nghiệm chơi.","link":"https://tetris.wiki","id":"ed8376d4912bba7a6aaaa79329802efab2e19f95"},{"title":"Tetris Wiki Fandom","tags":["nhom09a","tetris","wiki","fandom"],"category":"help","content":"Cũng là một wiki về Tetris nhưng nó ở trên Fandom","link":"https://tetris.fandom.com/wiki/Tetris_Wiki","id":"90062d5081d44f5297a1a2a8a9b69d832e6507b7"},{"title":">B|Câu đố","tags":["nhom09b"],"category":"","content":"NHÓM 09B: CÁC TRANG WEB CUNG CẤP CÂU ĐỐ","link":"","id":"1d90b0ee512c67d5486b93579370d142c6723052"},{"title":"TTT","tags":["nhom09b","tetris","trainer","tres","bien","T.T.T."],"category":"game","content":"Tetris Trainer Très-Bien (viết bởi こな \"kona\"). Một website chứa các hướng dẫn thực hành các kỹ thuật nâng cao trong Tetris hiện đại (lưu ý: website này chỉ hỗ trợ bàn phím vật lý, không hỗ trợ bàn phím ảo).\nĐề xuất cho những người chơi có thể hoàn thành chế độ 40L chỉ làm Tetris + không dùng Hold\nWebsite này đề cập tới T-spin, finesse, SRS và một số setup để chơi Battle\nLiên kết sẽ dẫn bạn tới phiên bản tiếng Anh, được dịch bởi User670 (Bản gốc là bản tiếng Nhật).","link":"https://user670.github.io/tetris-trainer-tres-bien/","id":"71d9d1b69264d227c5b4766f2ebfbac701d41b45"},{"title":"TTPC","tags":["nhom09b","tetris","perfect","clear","challenge","T.T.P.C"],"category":"game","content":"Tetris Perfect Clear Challenge (viết bởi chokotia). Một website hướng dẫn bạn cách làm Perfect Clear khi sử dụng hệ thống xoay SRS và Bag-7 (chỉ hỗ trợ bàn phím). Đề xuất sử dụng nếu bạn đã hoàn thành TTT và đã làm quen với SRS\n\nLiên kết sẽ dẫn bạn tới phiên bản tiếng Anh, bản gốc là tiếng Nhật","link":"https://teatube.cn/ttpc/ttpc/","id":"788e505b25eabcdc0100002f72a2ddd424d3b3eb"},{"title":"NAZO","tags":["nhom09b"],"category":"game","content":"(ナゾ)\n\nMột website chứa các loại câu đố SRS từ dễ đến cực kỳ khó, bao gồm T-spin và All spin. Đề xuất cho những người đã hoàn thành TTT.\n\nLiên kết sẽ dẫn bạn tới bản tiếng Trung Giản thể, nguyên bản bằng tiếng Nhật.","link":"https://teatube.cn/nazo/","id":"741b2e6dc8778917dfde9ac1a18120b36708bfd3"},{"title":"TPO","tags":["nhom09b","nazo","T.P.O"],"category":"game","content":"Tetris Puzzle O. Một trang web bằng tiếng Nhật được viết bởi TCV100 (có lấy một vài câu đố từ NAZO sang).","link":"http://121.36.2.245:3000/tpo","id":"f75b34a257eb4589bb9da8a8bae8dc4ba6c2a8d4"},{"title":"4-wide Trainer","tags":["nhom09b","nazo"],"category":"game","content":"Một công cụ được viết bởi DDRKirby(ISQ) để học & làm quen 4-wide.","link":"https://ddrkirby.com/games/4-wide-trainer/4-wide-trainer.html","id":"083f48aa72654b5afce732b2f654c9dbdcd7f378"},{"title":">C|Setup","tags":["nhom09c"],"category":"","content":"NHÓM 09C: CÁC TRANG WEB BÀY SETUP","link":"","id":"7ec9157be0567a75744b5e31c784f4e3093f1fcd"},{"title":"Four.lol","tags":["nhom09c","four","wiki"],"category":"help","content":"Một website chứa các setup để làm opener","link":"https://four.lol","id":"8fdd85b06a22cc54cde1da6b6b906b69c43976b4"},{"title":"‘Tetris Hall’","tags":["nhom09c","tetris","hall"],"category":"help","content":"(テトリス堂)\\n\\nMột trang web tiếng Nhật, chứa nhiều setup, hướng dẫn cũng như có các minigame. Nó cũng có mô tả chi tiết về PC liên tiếp","link":"https://shiwehi.com/tetris/","id":"28d4411a1afd7846156edc4b96a6502dc650895c"},{"title":"‘Tetris Template Collections’","tags":["nhom09c","tetris","template","collections"],"category":"help","content":"(テトリステンプレ集@テト譜)\\n\\nMột trang web tiếng Nhật với các setup và các danh mục chi tiết. Hầu hết các setup đều có ảnh minh họa, vì vậy việc chia sẻ với người khác sẽ dễ dàng hơn.","link":"https://w.atwiki.jp/tetrismaps/","id":"5de3300951a61087ecb9cf4fd23fb76aafd55258"},{"title":"tetristemplate.info","tags":["nhom09c"],"category":"help","content":"(テトリスブログ - PerfectClear)\\n\\nMột trang web ở Nhật Bản chứa một số setup. Tuy số lượng không bằng các trang web khác nhưng bù lại các setup đều được giải thích rất chi tiết","link":"https://tetristemplate.info/","id":"6572160a0dc40c4c77efc706e93837605e9c3d32"},{"title":">D|Chia sẻ setup","tags":["nhom09d"],"category":"","content":"NHÓM 09D: CÁC TRANG WEB CHIA SẺ SETUP","link":"","id":"8a1c9097f012b946d14ada473c382b9855594318"},{"title":"Fumen","tags":["nhom09d"],"category":"help","content":"Đây là một công cụ chỉnh sửa bảng dành cho Tetris bằng tiếng Nhật. Thường được sử dụng để chia sẻ setup, PC solution (hướng đi để làm PC), v.v.\\nLiên kết của mục này sẽ dẫn bạn tới bản tiếng Anh.","link":"http://fumen.zui.jp/#english.js","id":"68197b2e0f89fcdc10577517e47572d90cb1843a"},{"title":"Fumen bản Đ.thoại","tags":["nhom09d","fumenformobile","fm"],"category":"help","content":"Fumen for Mobile (Fumen bản dành cho Điện thoại)\\nCũng là Fumen nhưng hỗ trợ cho màn hình cảm ứng","link":"https://knewjade.github.io/fumen-for-mobile/","id":"797553c87ac1b8b63b92e619a4c17f8774185fde"},{"title":"=[NHÓM 10]=","tags":["nhom10"],"category":"","content":"NHÓM 10: CỘNG ĐỒNG","link":"","id":"eae17ae001f6d36996a33ae818e73f7174972078"},{"title":"Tetris OL Servers","tags":["nhom10","tetrisonline","servers","tos"],"category":"org","content":"Hãy lên Google tra \\\"Tetris Online Poland\\\" để tìm server ở Ba Lan.\\nCòn nếu tìm server Tetris Online Study được đặt tại Trung Quốc (cung cấp bởi Teatube) thì nhấn vào nút hình địa cầu","link":"https://teatube.cn/tos/","id":"53b30a9bdad30dfb969678a1b954156a65bc9e49"},{"title":"Tetris Việt Nam","tags":["nhom10","community","vietnam","tetris","việt","nam"],"category":"org","content":"Một trong những cộng đồng xếp gạch tại Việt Nam. Đây là nơi chia sẻ kinh nghiệm và thông tin: bao gồm cả game, các giải đấu và các sự kiên liên quan đến xếp gạch.\n\nNhấn nút hình địa cầu để vào server Discord, còn nếu muốn vào nhóm Facebook thì hãy vào Facebook và tìm nhóm \"Tetris Việt Nam\".","link":"https://discord.gg/jX7BX9g","id":"a5cd01860fc671cebafc8270bf4aa99bb058d621"},{"title":"=[NHÓM 11]=","tags":["nhom11"],"category":"","content":"NHÓM 11: XẾP LÊN VÀ ĐÀO XUỐNG","link":"","id":"1816caf61b243fd228668ffdd16adf60a0a8627c"},{"title":"A|Stacking","tags":["nhom11a"],"category":"","content":"NHÓM 11A: STACKING (XẾP LÊN)\\n\\nDùng để chỉ việc xếp các gạch làm sao mà không để lại một cái lỗ.\\nĐây là kỹ năng càn thiết yêu càu khả năng tận dụng hàng NEXT.\\nBạn có thể cải thiện kỹ năng này bằng cách luyện tập 40L với 0 HOLD","link":"","id":"5655035f52e93885bc666b700c5c6c17c9eb2c5d"},{"title":"Side well","tags":["nhom11a","ren","combo","sidewell"],"category":"term","content":"Một phương pháp xếp gạch đặc biệt mà bạn sẽ để lại một cái lỗ có một chiều rộng nhất định ở một bên bảng.\\n\\nCó 4 loại setup này: Setup Side 1-wide là setup truyền thống để làm Tetris (ví dụ như, Side well Tetris). Các loại setup như Side 2-, 3-, hay 4-wide; là những setup được dùng để làm combo.\\n\\nĐối với những người chơi mới, đây là cách hiệu quả nhất để tấn công.\\n\\nNHƯNG, đối thủ có thể dễ dàng tấn công lại bạn, một là chết còn không thì stack của bạn sẽ bị cắt ngắn do bạn phải phản công lại.\\nTrong thực tế, setup này chỉ dùng sau khi dùng setup T-spin nào đó hoặc là đối thủ chưa thể tấn công ngay; khi đó, side well có thể được sử dụng để tăng số cú tấn công tức thì.","link":"","id":"a0240cd8a4faf6cf6842388be03766059dbb81b1"},{"title":"Center well","tags":["nhom11a","ren","combo","centerwell"],"category":"term","content":"Một phương pháp xếp gạch mà bạn sẽ để lại một cái giếng có chiều rộng nhất định ở giữa bảng. Bạn cũng có thể tránh bị top-out nếu giếng đủ rộng.","link":"","id":"58fa0a0bf0387857f2d9dae6fad86695f7b00ae4"},{"title":"Partial well","tags":["nhom11a","ren","combo","partialwell"],"category":"term","content":"Một phương pháp xếp gạch mà bạn sẽ để lại một cái giếng có chiều rộng nhất định nhưng không ở giữa hay một bên bảng.","link":"","id":"6200b2023b492893a872a9053da1f6fc7138b818"},{"title":"Side 1-wide","tags":["nhom11a","s1w","side1wide","sidewelltetris"],"category":"term","content":"Hay còn gọi là S1W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 1 ô ở một bên bảng.\\n\\nĐây được coi là setup / cách chơi xếp gạch kinh điển nhất\\n\\nNhững người mới tập chơi có thể dùng setup này để gửi Tetris, vì chúng có thể tấn công tốt trong một thời gian ngắn.\\nTuy nhiên, những người chơi giỏi hơn thường sẽ không dùng setup này do ít hiệu quả + dễ bị tấn công trong lúc xây → dễ bị game over; họ chỉ xây S1W nếu như tình hình hiện tại đủ thuận lợi cho setup này.\\n\\nSetup này còn được biết tới với cái tên \\\"Side well Tetris\\\".","link":"","id":"925c4826b57231e3f6271e8d9d79f5f892e8604d"},{"title":"Side 2-wide","tags":["nhom11a","s2w","side2wide","sidewell"],"category":"term","content":"Hay còn gọi là S2W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 2 ô ở một bên bảng.\\n\\nS2W rất dễ xây và có thể tạo ra combo khá dài khi kết hợp với HOLD.\\nTuy nhiên, những người chơi giỏi hơn cũng sẽ ít khi dùng setup này vì các lý do tương tự như S1W.","link":"","id":"947eff513868be5c761b7a187883a05176c7bc9c"},{"title":"Side 3-wide","tags":["nhom11a","s3w","side3wide","sidewell"],"category":"term","content":"Hay còn gọi là S3W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 3 ô ở một bên bảng.\\n\\nĐây là setup it phổ biến hơn so với Side 2-wide.\\n\\nMặc dù khi so sánh, S3W có thể làm nhiều combo hơn so với S2W nhưng S3W hay dễ bị hỏng combo.","link":"","id":"1b780e9fef6c285b10ad9a6d5e4381bfc11d1534"},{"title":"Side 4-wide","tags":["nhom11a","s4w","side4wide","sidewell"],"category":"term","content":"Hay còn gọi là S4W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 4 ô ở một bên bảng.\\n\\nĐây là setup phổ biến dùng để làm combo.\\n\\nNgoài việc tạo ra được những combo dài hơn, S4W lại tốn ít thời gian hơn để xây so với setup side well khác. Việc này cho phép người chơi gửi tấn công sớm hơn trước khi đối thủ có thể trở tay kịp.\\n\\nSo với C4W, S4W được coi là cân bằng hơn vì người chơi có thể bị top-out trong khi đang xây setup này.","link":"","id":"acf005a3adc32aa0b212bc58cf7a937f21081685"},{"title":"Center 1-wide","tags":["nhom11a","c1w","center1wide","centerwelltetris"],"category":"term","content":"Hay còn gọi là C1W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 1 ô ở giữa bảng.\\n\\nChủ yếu dùng trong combat bởi vì cho phép làm Tetris và T-spin trong khi nó không quá khó để làm.","link":"","id":"c25f07d5e9445f1d32a8c08a5aec9b50e8063fcc"},{"title":"Center 2-wide","tags":["nhom11a","c2w","center2wide"],"category":"term","content":"Hay còn gọi là C2W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 2 ô ở giữa bảng.\\n\\nĐây là một setup combo có thể làm được nhưng ít phổ biến lắm.","link":"","id":"2e85bd6062974ccbd7deda1e0af80d2d41fd46f4"},{"title":"Center 3-wide","tags":["nhom11a","c3w","center3wide"],"category":"term","content":"Hay còn gọi là C3W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 3 ô ở giữa bảng.\\n\\nĐây là một setup combo có thể làm được nhưng ít phổ biến lắm.","link":"","id":"346e3a3e9e42b25edbada824c6d522a7dab3d49f"},{"title":"Center 4-wide","tags":["nhom11a","c4w","center4wide"],"category":"term","content":"Hay còn gọi là C4W.\\nVới setup này bạn sẽ xây một cái giếng sâu rộng 4 ô ở giữa bảng.\\n\\nĐây là một setup khét tiếng có thể tạo ra lượng combo rất lớn nếu người xây tận dụng tốt.\\nSetup này rất dễ xây, và có khả năng phòng thủ tốt trước các đòn tấn công bằng cách lợi dụng một lỗ hổng khi kiểm tra điều kiện chết trong (đa số) các game xếp gạch.\\n\\nRất nhiều người chơi ghét setup này vì nhiều lý do khác nhau; nhưng chủ yếu là vì phần thắng luôn thuộc về những người dùng setup này.\\nHãy cẩn thận khi dùng setup này trong các trận đấu thực tế.","link":"","id":"23141a356aeb11accae01d33da3d2608c264400f"},{"title":"Residual","tags":["nhom11a","c4w","s4w"],"category":"term","content":"Thuật ngữ này đề cập đến số ô gạch được để dư trong cái giếng sau khi xây xong setup 4-wide.\\nCác combo dài chủ yếu được thực hiện bằng cách dùng 3-residual (3-res) hay 6-residual (6-res).\\n\\n3-res dễ học hơn tại vì nó có ít biến thể hơn và có cơ hội cao để tạo ra combo dài hơn\\n6-res linh hoạt hơn nhiều đồng nghĩa với việc khó nhớ hơn, nhưng combo tạo ra lại dài hơn 3-res nếu mọi thứ thuận lợi.\\n\\nNói chung, thứ tự ưu tiên của setup này là 6-res, rồi 3 sau đó 5, và cuối cùng là 4-res.","link":"","id":"d32a745334d3ce125b1653483dd243c10f21a17b"},{"title":"6 - 3 Stacking","tags":["nhom11a","63stacking","six-three","sixthree"],"category":"term","content":"Một phương pháp để xếp gạch đặc biệt, khi bạn sẽ phải tạo ra một bức tường cao rộng 6 ô ở bên trái và một bức tường cao nữa rộng 3 ô ở bên phải.\\n\\nĐối với một người chơi có kỹ năng, phương pháp cho phép người chơi giảm số phím cần nhấn, và đây là một phương pháp phổ biến để chơi Sprint (như 10 hàng, 20 hàng, 40 hàng,…). Phương pháp này hoạt động được nhờ việc vị trí xuất hiện của 3 gạch J, L, T hay dịch về bên trái 1 ô.\\n\\nNhắc nhẹ: Phương pháp này CÓ THỂ tăng số lần nhấn phím ở người mới tập chơi.","link":"","id":"cbb6156cbd7cc08b97a5b0c5badfe86aff1ff970"},{"title":">B|Digging","tags":["nhom11b"],"category":"","content":"Digging (Đào xuống)\\nCòn được biết tới với tên là Downstacking\\n\\nDọn hàng rác để tiếp xúc đáy bảng.","link":"","id":"78bee480e1ce8fcbcd48a5cc8d38ca5ab41b6768"},{"title":"=[NHÓM 12]=","tags":["nhom12"],"category":"","content":"NHÓM 12: Setup (Opener, Mid-game setup, Donation)","link":"","id":"15ecf9228c926cff650e2e4cd5c45f05aa793283"},{"title":">A|Opener","tags":["nhom12a","opener"],"category":"","content":"NHÓM 12A: OPENER\nOpener thường là các setup thường dùng ở đầu trận. Bạn vẫn có thể làm những setup này giữa trận, nhưng thường sẽ yêu cầu một tập hợp các vị trí gạch khác nhau.\n\nOpener phải đạt 2 trong 4 tiêu chí sau\n- Có thể thích ứng với các chuỗi gạch khác nhau,\n- Tấn công mạnh, ít lãng phí gạch T\n- Dùng Finesse trong đa số hành động, ít dùng thả nhẹ\n- Có chiến lược rõ ràng và ít nhánh / biến thể.\n\nĐa số opener được thiết kế cho kiểu xáo Túi 7. Chúng có thể không hoạt động với các kiểu xáo khác.","link":"","id":"cbfbfce08ebf5a4f68b1f6c6cf35de2c6e003fca"},{"title":"DT Cannon","tags":["nhom12a","opener","dtcannon","doubletriplecannon"],"category":"setup","content":"Double-Triple Cannon (Súng thần công T-spin Đôi-Tam).\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=dt","id":"b7dca635191ef93f5bd3c0c4dcc6465452951f40"},{"title":"DTPC","tags":["nhom12a","opener","dtcannon","doubletriplecannon"],"category":"setup","content":"Phần tiếp theo của DT Cannon kết thúc bằng All Clear.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=dt","id":"3c5b6c5f8c67d7ca3793cff41459a3849a74053e"},{"title":"BT Cannon","tags":["nhom12a","opener","btcannon","betacannon"],"category":"setup","content":"β Cannon, Beta Cannon.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=bt_cannon","id":"6e0f95b11fd26854d65eceebb9b563d6baacf9cd"},{"title":"BTPC","tags":["nhom12a","opener","btcannon","betacannon"],"category":"setup","content":"Phần tiếp theo của BT Cannon kết thúc bằng All Clear.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=bt_cannon","id":"02380c1a86f27ac086dc7c478bf382bc9a85049b"},{"title":"TKI 3 Perfect Clear","tags":["nhom12a","opener","ddpc","tki3perfectclear"],"category":"setup","content":"Một opener làm TSD dẫn đến Double-Double-All Clear.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=TKI_3_Perfect_Clear","id":"7a8068258cb3a9856b10bc2f582e4e2e5f761f51"},{"title":"QT Cannon","tags":["nhom12a","opener","qtcannon"],"category":"setup","content":"Một setup gần giống với DT Cannon và khả năng gửi DT Attack¹ cao.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop\\n\\n¹: DT Attack = T-spin Double + T-spin Triple","link":"https://harddrop.com/wiki?search=QT_cannon","id":"5aab9280708179c398e946086be6ef7a089b2ee7"},{"title":"Mini-Triple","tags":["nhom12a","opener","mt","minitriple"],"category":"setup","content":"Một setup làm Mini T-spin và T-spin Triple.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=mt","id":"e52160963ee209c45ed884fa82cffec79586a7b7"},{"title":"Trinity","tags":["nhom12a","opener"],"category":"setup","content":"Một setup làm TSD + TSD + TSD hoặc TSMS + TST + TSD. Để có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=trinity","id":"911d077de03982a50738101497a7af399bcaefc2"},{"title":"Wolfmoon Cannon","tags":["nhom12a","opener","wolfmooncannon"],"category":"setup","content":"Một opener.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=wolfmoon_cannon","id":"80c1fb840f781d41f159c481f3cb7415d88b5706"},{"title":"Sewer","tags":["nhom12a","opener"],"category":"setup","content":"Một opener.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=sewer","id":"14290bc66fd877b60151616eb17365bcee5477ae"},{"title":"TKI","tags":["nhom12a","opener","tki-3","tki3"],"category":"setup","content":"TKI-3. Có thể chỉ TKI-3 bắt đầu bằng một TSD hoặc C-spin bắt đầu bằng một TST.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=tki_3_opening","id":"def33bada80d3a7cb798e5d5b02cf129cd624097"},{"title":"God Spin","tags":["nhom12a","opener","godspin"],"category":"setup","content":"Một setup nhìn đẹp mắt [nhưng khó sử dụng trên thực tế]. Được phát minh bởi Windkey.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=godspin","id":"f4ecaf38f9adae8c0124c279cd1b404c5555bf08"},{"title":"Albatross","tags":["nhom12a","opener"],"category":"setup","content":"Một opener nhìn đẹp mắt, nhịp độ nhanh với TSD - TST - TSD - All Clear, khó mà lãng phí được gạch T.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=Albatross_Special","id":"47ebe12f4d769df30ee91590082c15f9a05af93f"},{"title":"Pelican","tags":["nhom12a","opener"],"category":"setup","content":"Một opener kiểu Alabatross được sử dụng trong trường hợp trật tự gạch tới không ủng hộ opener Alabatross gốc.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=Pelican","id":"96fafbede9d43aa8c9e271d737200b55ae67b443"},{"title":"Perfect Clear Opener","tags":["nhom12a","opener","7piecepuzzle"],"category":"setup","content":"Một opener làm All Clear có khả năng thành công cao (~84.6% nếu bạn đang giữ I trong ô HOLD và ~61.2% nếu không giữ).\\n\\nTrong chế độ PC Training (Luyện tập PC), setup này được sử dụng để tạo ra setup chưa hoàn chỉnh, không tạo ra lỗ.\\n\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=Perfect_Clear_Opener","id":"ce2db6dbe071f5f8b67ae79aac9ce7a5199eeb5f"},{"title":"Grace System","tags":["nhom12a","opener","gracesystem","1stpc"],"category":"setup","content":"Một opener làm PC có khả năng thành công ~88.57%. Lỗ hình vuông 4 × 4 trong chế độ PC Training cũng dựa trên setup này.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên Four.lol","link":"https://four.lol/perfect-clears/grace-system","id":"851979f05f51cfd8a6279c749f0a75752a56e1b4"},{"title":"DPC","tags":["nhom12a","opener"],"category":"setup","content":"Một setup làm TSD + PC gần như 100% không có gạch nào trong bảng và gạch cuối cùng trong Túi 7 gạch trong hàng đợi NEXT.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên tetristemplate.info.","link":"https://tetristemplate.info/dpc/","id":"d568180d2c1ea8330d6bcd939fa9bd5d85cf9aec"},{"title":"Gamushiro Stacking","tags":["nhom12a","opener"],"category":"setup","content":"(ガムシロ積み) Một opener làm TD Attack (TD Attack = T-spin Triple + T-spin Double).\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=Gamushiro_Stacking","id":"778b75a6a4ccde51b4bc60cc20293650951e1c63"},{"title":">B|Mid-game","tags":["nhom12b","midgame","mid-game"],"category":"","content":"NHÓM 12B: MID-GAME SETUP\\n\\nChỉ những setup cho phép gửi nhiều rác giữa trận. Một số có thể dùng làm opener, nhưng hầu như chúng không cần thiết.","link":"","id":"24dc40e8bb63349e3b09e635b8ea25090e5e2f60"},{"title":"C-spin","tags":["nhom12b","midgame","mid-game","cspin"],"category":"pattern","content":"Một setup gửi tấn công bằng T-spin Triple + T-spin Double, known as TKI in Japan.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=c-spin","id":"28581dd8fea5d6e5eaed2ff4eb8b5dc94964edfa"},{"title":"STSD","tags":["nhom12b","midgame","mid-game"],"category":"pattern","content":"Super T-spin Double, một setup cho phép làm T-spin Double.\\nNhưng nếu có rác ngay dưới setup này thì không tài nào làm T-spin Double được\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=stsd","id":"61e264873c7bd3df7b83fc30f1662d0e572d6032"},{"title":"Fractal","tags":["nhom12b","midgame","mid-game","fractal","spider"],"category":"pattern","content":"Một setup dùng để làm T-spin.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=Fractal","id":"9074eb8259957b206d48102e5cfac9c4d6b87136"},{"title":"LST stacking","tags":["nhom12b","midgame","mid-game"],"category":"pattern","content":"Một setup dùng để làm T-spin với số lượng vô tận.","link":"https://four.lol/stacking/lst","id":"eef4869b8e0e95980d4504a5c5dd3ce0a9eb9743"},{"title":"Imperial Cross","tags":["nhom12b","midgame","mid-game","imperialcross"],"category":"pattern","content":"Che lỗ hình chữ thập bằng phần nhô ra để thực hiện hai lần T-spin Double\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=imperial_cross","id":"2dc9616322ede73254886a61f0c0eb57b39ac062"},{"title":"King Crimson","tags":["nhom12b","midgame","mid-game","kingcrimson"],"category":"pattern","content":"Xếp chồng để làm (các) TSD trên STSD.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=King_Crimson","id":"e5af8685b71405df0902fe100d06db57032c2c53"},{"title":"PC liên tiếp [1/2]","tags":["nhom12b","midgame","mid-game","pcloop"],"category":"pattern","content":"four.lol có hướng dẫn cách làm Perfect Clear liên tiếp. Sau khi hoàn thành PC thứ 7 khi bạn cũng vừa xài đúng 70 gạch (10 túi 7 gạch) nên bạn có thể quay về PC thứ nhất.\\n\\nNhấn nút hình địa cầu để xem setup cho PC thứ nhất (để xem các setup sau, hãy thay 1st trong link bằng 2nd / 3rd / 4th / 5th / 6th / 7th)","link":"https://four.lol/perfect-clears/1st","id":"8ec3440c009d06b37f33a1dcec8641757b6a6611"},{"title":"PC liên tiếp [2/2]","tags":["nhom12b","midgame","mid-game","pcloop"],"category":"pattern","content":"Một hướng dẫn làm vòng lặp PC hoàn chỉnh được viết bởi NitenTeria.","link":"https://docs.qq.com/sheet/DRmxvWmt3SWxwS2tV","id":"6423ee44f49c51659880da098bedd59569032937"},{"title":">C|Donation","tags":["nhom12c","donation","pattern"],"category":"","content":"NHÓM 12C: DONATION\\n\\nBiến một hố hoặc một cái giếng (ban đầu được tính để làm Tetris) thành setup T-spin bằng cách \\\"cắm thêm gạch vào\\\". Sau khi làm T-spin, hố đó sẽ được mở ra để cho phép bạn làm Tetris hoặc làm donation khác. \\\"Cắm thêm gạch\\\" vào hố hoặc giếng vốn không được tính để làm Tetris thì vẫn có thể gọi là \\\"donation\\\" như thường.","link":"","id":"01d73bb85a43ecc084a1dadb32d7ac37c99bd19d"},{"title":"STMB Cave","tags":["nhom12c","donation","pattern","stmb"],"category":"pattern","content":"STMB cave, một setup dạng donation bằng cách sử dụng S / Z để bịt tường rộng 3 ô và làm T-spin Double.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=stmb_cave","id":"e09adc791be46903e0475905ee57d6565b963e80"},{"title":"Hamburger","tags":["nhom12c","donation","pattern"],"category":"pattern","content":"Một setup dạng donation setup dùng để tạo cơ hội có thể làm Tetris.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=hamburger","id":"a1b3f0e1d4fcb2d33d4c4e4744956be3c3e4e8d6"},{"title":"Kaidan","tags":["nhom12c","donation","pattern","kaidan","stairs"],"category":"pattern","content":"Một setup dạng donation có thể làm TSD trên địa hình cầu thang.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=kaidan","id":"df668e737e9af15b2d556fb36fba25e0c0f46fd9"},{"title":"Shachiku Train","tags":["nhom12c","donation","pattern","shachikutrain","shechu"],"category":"pattern","content":"Một setup dạng donation cho phép làm thêm hai TSD từ setup TST.\\nĐể có thêm thông tin, bạn có thể nhấn nút hình địa cầu để mở bài ở trên wiki Hard Drop","link":"https://harddrop.com/wiki?search=Shachiku_Train","id":"dc4327a2f9935348b9ef75ee955fbf97ea92623e"},{"title":"Cut Copy","tags":["nhom12c","donation","pattern","cutcopy"],"category":"pattern","content":"Một setup dạng donation để làm T-spin Double trên một cái lỗ nhỏ và có thể làm thêm một TSD nữa sau đó.","link":"","id":"5ab976e8a5af8adf031a7c04b88533d46932d182"},{"title":"=[NHÓM 13]=","tags":["nhom13"],"category":"","content":"NHÓM 13: CÁCH TÍNH TẤN CÔNG","link":"","id":"0cf34b77a992d9444c4b6fb660932ca055b24721"},{"title":"Tetris OL attack","tags":["nhom13","top","tetrisonlineattack"],"category":"term","content":"Cách tính tấn công trong Tetris Online\n\nĐơn / Đôi / Tam / Tetris gửi 0 / 1 / 2 / 4 hàng rác.\nT-spin Đơn / Đôi / Tam gửi 2 / 4 / 6 hàng rác, cắt một nửa nếu là Mini.\nCombo gửi thêm 0, 1, 1, 2, 2, 3, 3, 4, 4, 4, 5 hàng rác.\nBack to Back gửi thêm 1 (hoặc 2 nếu T-spin Triple).\n\nAll Clear gửi thêm 6 hàng rác\nnhưng gửi thẳng vào bảng đối thủ thay vì không hủy rác tới.","link":"","id":"4765c7bf8080dc446727783cbfb98218e2d6d1cb"},{"title":"Techmino attack","tags":["nhom13","techminoattack"],"category":"term","content":"Cách tính tấn công trong Techmino\\n\\nĐể biết công thức tính, hãy xem \\\"hướng dẫn sử dụng\\\" bằng cách nhấn nút`CHAR.icon.helpở màn hình chính của game.\\n\\nNhấn nút hình địa cầu sẽ dẫn bạn tới một bảng tấn công đã được tính sẵn và bạn chỉ cần cộng dồn lại các giá trị bạn muốn để biết kết quả.","link":"https://media.discordapp.net/attachments/743861514057941204/1093386431096950815/Untitled.jpg","id":"bbb10059789fa25b2075ebc36ab81951fe6d159a"},{"title":"=[NHÓM 14]=","tags":["nhom14"],"category":"","content":"NHÓM 14: CONSOLE VÀ CHUYỆN QUẢN LÝ DỮ LIỆU GAME","link":"","id":"0f625146ccf71925c820a7deea6185e2e327db43"},{"title":"Console","tags":["nhom14","cmd","commamd","terminal","console"],"category":"command","content":"Techmino có một console cho phép kích hoạt tính năng gỡ lỗi và bật các tính năng nâng cao.\\nĐể truy cập, hãy chạm vào logo Techmino / nhấn phím C 4 lần, tại màn hình chính.\\n\\nCẢNH BÁO! CÓ RỦI RO KHI TIẾN HÀNH\\nHành động bất cẩn trong console có thể dẫn đến HƯ HỎNG\\nhoặc MẤT TOÀN BỘ dữ liệu đã lưu KHÔNG THỂ PHỤC HỒI.","link":"","id":"c4701699df064f6742c450c9f0713b5e8b602584"},{"title":"Đặt lại thiết lập","tags":["nhom14","reset","setting"],"category":"command","content":"Vào console, gõ \\\"rm conf / setting\\\" sau đó nhấn Enter / Return.\\nKhởi động lại Techmino để thay đổi có hiệu lực.\\nĐể hoàn tác / hủy bỏ thay đổi đã thực hiện, hãy vào Cài đặt rồi trở ra.","link":"","id":"46bfb4151deb3340b4565c5df3feef7b2e16adbe"},{"title":"Xóa t.bộ thành tích","tags":["nhom14","reset","statistic","data"],"category":"command","content":"Xóa toàn bộ thành tích\\n\\nVào console, gõ \\\"rm conf / data\\\" sau đó nhấn Enter / Return.\\nKhởi động lại Techmino để thay đổi có hiệu lực.\\nĐể hoàn tác / hủy bỏ thay đổi đã thực hiện, chơi một chế độ bất kỳ sau đó nhận màn hình Thắng / Thua","link":"","id":"9380af19a9eb44c593811bef033438d35ab745e4"},{"title":"Khóa t.bộ map","tags":["nhom14","reset","unlock"],"category":"command","content":"Tất cả các mode sẽ bị khóa lại như khi bạn vừa mới vào chơi lần đầu.\\n\\nVào console, gõ \\\"rm conf / unlock\\\" sau đó nhấn Enter / Return.\\nKhởi động lại Techmino để thay đổi có hiệu lực.\\nĐể hoàn tác / hủy bỏ thay đổi đã thực hiện, cập nhật lại tình trạng của một chế độ bất kỳ.","link":"","id":"7a138f3a53a945c1ebbe1d09e19791b16ab8cb43"},{"title":"Xóa t.bộ kỷ lục","tags":["nhom14","reset","record"],"category":"command","content":"Xóa toàn bộ kỷ lục\\n\\nVào console, gõ \\\"rm -s record\\\" sau đó nhấn Enter / Return.\\nKhởi động lại Techmino để thay đổi có hiệu lực.\\nBạn có thể hoàn nguyên hành động này trên cơ sở từng chế độ; chơi một chế độ và cập nhật bảng xếp hạng để khôi phục bảng xếp hạng của chế độ đó.","link":"","id":"e9fa1b2a3f8909dfa1168c6014f6b1e2171ff815"},{"title":"Đặt lại bố cục phím","tags":["nhom14","reset","virtualkey"],"category":"command","content":"Vào console, gõ \\\"rm conf / [File_bố_cục_phím]\\\" sau đó nhấn Enter / Return.\\nThay [File_bố_cục_phím] với file cần xóa:\\n\\t- File bố cục bàn phím trên máy tính: key;\\n\\t- File bố cục nút trên màn hình: virtualkey;\\n\\t- File chứa 2 slot bố cục nút trên màn hình: vkSave1, vkSave2\\n\\nKhởi động lại Techmino để hai thay đổi đầu tiên có hiệu lực.\\nVào một trang chỉnh sửa bố cục phím / nút sau đó trở ra để lấy lại file tương ứng.","link":"","id":"9c323e24fbce329e97460310e919a7cb7856986f"},{"title":"Xóa t.bộ replay","tags":["nhom14","delete","recording"],"category":"command","content":"Xóa toàn bộ bản phát lại\\n\\nVào console, gõ \\\"rm -s replay\\\" sau đó nhấn Enter / Return.\\nHiệu lực tức thì, KHÔNG THỂ HOÀN TÁC","link":"","id":"4a9bcc267ddba7abc283e0add9f228a23ec2e735"},{"title":"Xóa bộ nhớ đệm","tags":["nhom14","delete","cache"],"category":"command","content":"Vào console, gõ \\\"rm -s cache\\\" sau đó nhấn Enter / Return.\\nHiệu lực tức thì, KHÔNG THỂ HOÀN TÁC","link":"","id":"c0bffec2ae22b2b65d8895513ec607aaeff79d36"},{"title":"=[NHÓM 15]=","tags":["nhom15"],"category":"","content":"NHÓM 15: CÁC THUẬT NGỮ KHÔNG LIÊN QUAN TỚI TETRIS (TIẾNG ANH)","link":"","id":"5aa188a1092b739c02013c789b2c87549ea5f3db"},{"title":"SFX","tags":["nhom15","soundeffects"],"category":"english","content":"Từ viết tắt của \\\"Sound Effects\\\" (Hiệu ứng âm thanh). Ở Nhật Bản, từ này được viết tắt là \\\"SE\\\".","link":"","id":"3716fe2cf35bd0f840b748adb1588c09c7f7daa7"},{"title":"BGM","tags":["nhom15","backgroundmusic"],"category":"english","content":"Từ viết tắt của \\\"Background Music (Nhạc nền).\\","link":"","id":"0e5eb85ca4390fbb0e8f302a9fee918bec29b137"},{"title":"TAS","tags":["nhom15"],"category":"english","content":"Từ viết tắt của \\\"Tool-Assisted Speedrun (Superplay)\\\" (Công cụ hỗ trợ Speedrun)\\nChơi một game nào đó mà không cần công cụ đặc biệt để phá vỡ quy tắc của game (ở cấp độ chương trình / phần mềm).\\nNó thường được sử dụng để đạt điểm tối đa theo lý thuyết / đạt được những mục tiêu thú vị\\nMột công cụ TAS như vậy cũng có sẵn, nhưng là bản nhỏ gọn, được đi kèm với Techmino.","link":"","id":"071cfabe02ce9bc29cd5aa03055b6b828ea97e57"},{"title":"AFK","tags":["nhom15"],"category":"english","content":"Từ viết tắt của \\\"Away From Keyboard\\\" nghĩa là hiện đang nghỉ ngơi / làm việc khác VÀ không đụng game.\\nNghỉ giải lao thường xuyên giúp bạn giảm căng cơ và giúp bạn chơi tốt hơn khi quay trở lại.","link":"","id":"250f02dc717d92615423049ab28ed843fb748247"}]